{"_default": {"1": {"body": "Are you looking for an escape? An immersive getaway experience? Well, there's a place for all your wildest dreams. Perhaps you enjoy wrapping along the paperboy, or you believe that blessed be the fruit. Or you dream of one day smashing a glass while stealing. Who's. Ah. Whether you're sworn to Team Kim or you just want a good old fashioned mysterious murder, there's a place that has it all. From Atlanta to only murders in the building, it's all on Hulu. So check into your obsessions. Hulu subscription is required. Terms apply. Visit hulu.com for plan details. Brought to you by the all new 2014 Toyota Corolla. Welcome to stuff you should know from houseuffworkscom. Hey, and welcome to the podcast. I'm Josh Clark and Charles W. Chuck. Bryan is with me, and Jerry's over there. So this is stuff you should know. Your legendary podcast. Live version? Yes. Well, it's recorded live to tape. Tape? We've done. Live version? Yeah. Like with an audience? Yeah. I don't know if you remember. Sure. We've done it. Sure. Should we set up this a little bit? I'd like to. Oh, yes, go ahead. Well, people, when you listen to Stuff You Should Know, a lot of times you're regaled with stories of history or stories of science or cool animals or you name it. We like to cover lots of stuff, but occasionally we like to do a little advice. Yes, but the fact that we're doling out advice does not mean that we are professional advisors. No, but occasionally we like to talk about things like green living or health and fitness or in this case, finance. Just because we know the millennials out there think they're never going to have to worry about anything. But eventually you're going to be off the teeth of your parents and you might have to think about this stuff. Either that or the millennials are already more worried than anybody else right now. Yeah, and not just millennials. I think anybody could use this advice and put it to pretty good use. Well, yeah. One thing I realized is that you're never too young or you're never too old to start being smart and thinking about money in your future and stuff like that. If you're in the last weeks of your life, it's too late. It may be too late, so never say never. That's true. But yes, the younger you are, the better off you are. The later you start, the further you have to catch up. But the point is, there's no reason to not try. And what we're talking about is saving money. But it's not just saving money. It's part of like saving money is the basis of basically a conscientious lifestyle. Yeah. You don't have to be rich and you don't have to even want to be rich. Basically all you have to have is the desire to be financially independent or close to financially independent and financially free. And that doesn't mean you have to have gobs of money or endless amount of cash, actually, it's pretty easy to sit there and figure out how much money you need and set that as your goal and get to it. And the cool thing is, if you do kind of take this advice, you do kind of start following this path, I guess you could say. Sure. It becomes a bit addictive and you realize that you've just altered your mindset and you're living basically the antithesis of a wasteful consumer culture life and sticking it to the man. That's right. And you don't have to be a fregan to do it. No, there's a middle ground that's just being smart and frugal where you need to be. I get into it. It's not like I'm loaded or anything, but I don't think about the money so much as I think about efficiency and waste. Right. That really occupies a lot of my mind. Once you start thinking about everything in those terms, all of a sudden it becomes very clear and every little bit counts because take energy, which we'll get into, if you unplug your toaster every day after you use it, what's that going to add up to? Like, virtually nothing, actually. I have a bet on vampire power. We'll talk about it. Good, I'm glad you do. And it's not much, though, right? Well, we'll talk about it. All right. But let's say a toaster is not much. Just a single toaster, right? It's not much. Thank you. But if you take that toaster and pile it in with savings on not buying coffee every day while you're out and thinking about your auto insurance and just all the stuff that we're going to talk about and think of all of it as what you're throwing into a pot or savings, then it does count. It does matter totes yeah. Good intro. Thanks, man. So the recommended amount that I've seen I don't remember what investment advisor wrote the article or whatever. But I've seen before that you want to save what amounts to about eight times your ending salary. No matter what your ending salary. That's the salary you're going to have when you retire is that is a mind bogglingly daunting number. If you think about it. To have that much in the bank by the time you retire. Yeah. Eight times? Yeah. Man, I better get busy. Supposedly you're supposed to have, like, one time what you estimate your ending salary would be by the time you're 33 times, by the time you're 40, and then so on, until by about the time you're 65, you should at eight times your ending. Sorry. That's a lot of money. Yeah, I'm a lot of savings. Okay. I think pretty much everybody is a bit behind. Sure. I think that's a very important point. I don't feel like anybody, especially somebody who feels daunted by that number, should feel like that they're on the outs and that everybody else is doing well, but at the same time, that doesn't mean that just because everybody else is saving that you shouldn't start. Yeah. Don't compare yourself to others. Just take care of your business. Right. And that's what this whole thing is about. Don't worry about the Joneses. So one of the first things you want to do is figure out what that eight time amount is and set that as your goal by the time you're 65. And then start looking around and figuring out ways to get there. And one of the best ways is to stop wasting. Wasting is the opposite of saving. That's right. So if you save, you're not wasting, and if you waste, you're doing the wrong thing. Exactly. So here's some ways you can save. Yeah. You don't get into this. Entertainment is a lot of times one of the first things on the list because a lot of things in the entertainment category are luxuries, meaning they make your life better, which is super valid. You just can't do it all all the time. Unless you're super rich, then go nuts for you. You're super rich already. Then for instance, maybe you can get the same content online as you're paying for either with a cable bill or like a magazine subscription or a newspaper or something. You might be able to get all that stuff free online. Save yourself some bucks. Sure, that's one way to do it. You make a good point that entertainment is a luxury, but it's also in a lot of ways of necessity too. You just have to look around and say, where can I trim some fat? Where am I being wasteful? Is there anything that I'm just not really using that I'm paying for in the entertainment category? And if so, then that means I probably don't really need it and I should stop just paying for it out of habit. Yeah, well, the Netflix is one thing I dropped finally the DVD delivery in favor of just the online streaming. And what did it say? I think it's like $8 a month or something that adds up when you throw it into a pot. It adds up. It's like over the course of the year that's like, that's a nice meal out or money you could invest in something else, right? Yeah, same like you said with magazine subscriptions, if you're getting the magazine and it's just sitting there and you're not really reading it or getting anything from it, cancel your subscription and say, by the way, I already paid for this, so send me what you owe me. So yeah, if you love your magazines, then that one wouldn't count. Again, what we're talking about here is trimming the fat, not living this horribly mindset lifestyle. Yeah. That is no fun whatsoever. No, but like we said, once you start getting into this, you're probably going to find that it's actually fun to look for ways to trim the fat. Yeah. And speaking of trimming the fat. Take a look at your gym membership, people. How often do you go and what do you do while you're there? If it's something you get a lot of benefit out of, then by all means keep going, set your health. But do you know who pays $75 a month to go running on a treadmill? Jerry? A sucker. Because there are streets, there's sidewalks, there's running trails. Right. If you're not utilizing most of the stuff at the gym or going to classes and things, you might want to think about trimming the fat. Or if you really need that ritual for that treadmill and you don't mind paying that money for the treadmill, that's fine too. But just think about it. Yeah. If you are shameless or you have no self consciousness whatsoever, you can go use the exercise equipment at the park. Yeah. Those little things they have going on. Yeah, I just couldn't do that. Or you can work out at the park. We could buy a treadmill and have it tease you and mock you and haunt you for the rest of your life in the spare room. Right. Which is what happens sometimes. I think that's the opposite of good advice as far as this one goes. That's true. What about automotive costs? That's a really satisfying way to save money because nobody likes paying for car up, maintenance and gas. Right. Two things people hate spending money on. I got some numbers for you. Okay. Let's say you drive 80 0 mile over five years. If you bought a car that gets 25 miles to the gallon compared to one that gets 15 miles to the gallon, you're going to be buying 2000 fewer gallons of gas over that time average of 350 a gallon over five years, you've saved $7,000 in gasoline costs, which is like I mean, that's super substantial. And you could put that into your 401 kwh or whatever oh yeah. And make that into a lot more money by the time you retire. Just by 10 miles a gallon difference. By not getting that ginormous SUV, you can't even park. Maybe get something more fuel efficient instead. Sure. Well, yeah, I mean, that's a seven grand in your pocket that you just wouldn't have had before. Exactly. What else? Your car insurance is another good place to go, like anything you're currently paying for. That's a good place to start and say, how can I pay less for the same amount? Or do I need the same amount that I have right now? So usually if you have a decent insurance person, you will find that they will be happy to talk to you and say, yeah, you don't really need this. Or if you raise your deductible a little bit, you'll probably be okay and you'll be paying less per month without losing out on anything. Really? Yes. Another place you can save gas is and a lot of people don't realize this but your tires in your car are supposed to be inflated to a certain amount. And if they're lower than that, you're going to be wasting gas. Yeah. In fact, for every £2 per square inch that you're off that they're low, your mileage goes down by 1%. And in this article, they judge most cars are about five to £10 per square inch low, and that's about 5% less fuel efficient. Just by putting air in your tires? Yes. That's crazy. Plus, even more, there's a lot of gas stations that have free air. Yes. Not as much anymore, but your road trip does. Do they? Oh, yeah. All right, let's go to QT. Hey, everyone. When you're running a small business, every second counts, and you can't afford to waste a single moment. So why are you still taking time out of your day to go to the post office? And you could be using stamps.com. Yeah. For more than 20 years, stamps.com has been indispensable for over 1 million businesses because stamps.com gives you access to all the post office and ups shipping services you need, right. From your computer. That's right. You can streamline your shipping process with stamps.com easy to use software. All you need is your regular computer and printer. No special supplies or equipment necessary, and you can get discounts you can't find anywhere else, like up to 30% off USPS. Rates and 86% off ups. So stop wasting time and start saving money. When you use stamps.com to mail and ship, sign up with promo code stuff for a special offer that includes a four week trial, plus free postage and a digital scale. No long term commitments or contracts. Just go to stamps.com. Click the microphone at the top of the home page and enter code stuff. Let's see what else. Chuck all right. You want to talk grocery stores? Always. All right. First of all, right. Now would be a terrible time for me to go grocery shopping because I'm very hungry. Yes. They say to eat first time. Yeah, it really does work. It makes an enormous difference on buying stuff that you normally wouldn't buy if you are hungry at the grocery store, like you're just going to buy more. It's a proven fact. That's right, Josh. And then going out to lunch at work is a big deal. Big expense, potentially. Yeah. They say in here, $6 a day is 800 a year, but $6 a day, that's super cheap. It is. You probably won't live a year if you're eating six dollar lunches every day. Yeah, let's say that's $12. Or if you go out for business lunches, you're really racking up money. Right. And if it's not just you, but also your spouse or significant other life partner or whatever also doing the same thing, you can double that amount right there. So I just get around the whole thing by not eating lunch. But you could also pack your own lunch, save a substantial amount. Plus, it's like you're being your own mom, packing your lunch in the morning. You make yourself a note, even. Right. And then chuck at the grocery store, too. If you take a little time and go online or get your favorite grocery stores app, they have those these days. You can find all sorts of specials, coupons, that kind of thing, and say, what can I do with celery and chickpeas? Right. And then you put them together and base your weekly plan on that. You could make hummus and dip the celery in it. Exactly. And you take that list that features chickpea and celery and whatever else it takes to make hummus and take it to the store, and you stick to that list. Maybe some garlic. Exactly, paprika. But the point is, you've thought about all this before you went to the store, wrote it down on a list and then stuck to the list and then used the coupons that originally got you to think of hummus in the first place. You just save yourself some money, an incalculable amount, mainly because I don't want to calculate it right now. That's right. Yeah. Keep your eyes peeled at the store for specials. I know you don't want to grab the little flyer when you walk in because it makes you look like you're 80 years old, but that's where you find out the deals. They're buy one, get one free on a tub of butter. Go get the tub of butter and get your second one for free. That's right. Also, I want to apologize to her 80 year old listeners who like circulars at the grocery store. Yeah, my mom was way into coupons. Yeah, well, a lot of people are. Yes. I read that apparently coupons have gone down in quality because of this coupon craze that's going on right now. So many people are using it that companies are like, we can't afford to put out decent coupons. Did you just say there's a coupon craze going on? Yeah. Really? Did you not know? No, I didn't. Oh, man. There's whole TV shows dedicated to it. Coupon craze? Yes. Really? Is it the name of the show, coupon Craze? No, there's like extreme couponing. Really? I think on TLC. I've never heard of that. What? No. Is it just people like it's? People who are so good at couponing. I saw a man on a TV show, he had like a $400 grocery bill, and from his coupons, he brought it down to like $14. I thought you were going to say they paid him $100. It was close to it. It was very close to it. Yeah. Most grocery stores have the little club card. Use those. That's really satisfying to see all that money go away in the end. Yes. Not only that, some of those cards will get you like extra bucks or points or whatever that will actually deduct money from your additional money on top of coupons from your bill after a while. It's not a bad idea to take advantage of loyalty programs. Oh, that's what it should do if it makes sense to you. There are plenty of people out there that own companies that have come up with loyalty programs that are frankly scams, and you have to be wary of them because you don't want to buy stuff you wouldn't normally buy just because you're going to save $0.50 on it because it costs you 350 that you weren't going to spend anyway. But if you're going to the same store again and again and again, it's just down the street. They have pretty good prices. You like their coupons, sign up for their loyalty program and it will pay off in the end. Yes. I go to a buzz market here. I go to Kroger when I can, and they keep track of your thing through your little card. And then I get gas or two because A, it's cheaper already, but every like, four or five. Phillips they'll give you credit from your grocery buys on your gas, right? They'll say, like, would you like to save ten cents a gallon because you bought groceries? Is there like an actual no button? There's a note. No, because you can save it. Like give it to your wife or whatever, or I'm flushed this week, if that's how you live, sure. But I always say, heck, yeah. Give me the remember hearing a long time ago that they were trying to outlaw gas discounts? Like, some of those places sell gas below what they pay for it to attract people into their stores, and it was like driving other gas stations out of business. Yeah. When it comes to saving, baby, it's survival of the fittest. All right, let's talk about family expenses, things like your prescription drugs or maybe your baby formula, all these things. You can get generic versions of that are FDA approved to be just as good as your brand name version. Yeah, you know who buys brand name stuff, suckers? Brand name drugs. Yeah. Well, it says here in this article that drug companies spend all their money on research and development and stuff like that. That's not true. Most drug companies get universities to do their RMD for free, but they just have the patent on it for the first few years and can charge whatever they want depending on the country they're in. The point is, generics have the exact same thing in it. By law, they don't own the patent, and the patent is expired. So now everybody can sell it for cheap. Buddy, I know one way you save a lot of money in the past few years. Smokies yes. Not smoking. Yeah, cigarettes. How much are they now? Last I saw, they were like, $5 a pack. In Atlanta, they're like, $12 a pack or so in New York. Really funny dollars a pack. And I remember when they started to go up. Yeah, because I smoked at a time when you could get them for like, a dollar, $50 a pack. Sure. And then all of a sudden, they were like, $3.04, five. And there were articles because tobacco is going through the roof, and there are articles on what the price point would be where people stop smoking. Yes. I remember hearing a lot of people say five, and that's just not some people, I'm sure, quit because they hit $5. But no, people will still smoke and pay $5 or $12 a pack every day to shorten their life and incur more medical expenses later on. Right. And the point is, if you quit, it's just like having a higher fuel efficiency car, or it's just money in your pocket that you otherwise would have spent unnecessarily. And like you said, this is just harmful and you're spending money. So that's a great one right there. Quit smoking. Thousands of dollars a year. Bam. Right in your pocket. Boom. They say quit drinking in this article, too. That your addictions are costing you money. Pretty much anything that you could give up, that maybe you should give up, that can save you money, that falls into this category. Yeah. Or maybe if you like your glass wine with dinner, maybe just pick and choose and cut down and save a little money and improve your health a little bit. Right. Buy the gigantic box of wine to get better value. Moderation. It's the key. Except with smoking, there shouldn't even be moderation there. Yeah. Just don't smoke. Household energy is the one I'm obsessed with, pretty much. Really? Yes. I grew up in a house, teachers as parents, three kids. Like, we had to use coupons and turn off the lights when you left the room and not leave the TV going. And we had to do that to get by and to live just a normal lower middle class life. But that's not something you should change because it's just wasteful. Well, yeah. Even if you have the dough, you shouldn't waste energy. Yes, that's exactly right. That's a good point. Chuck. One of the things about changing your mindset to a saving mindset is not only is it good for you financially, but it also tends to have positive spillover effects. Like, for example, you're saving money, saving energy, but it's also a lot better for the environment. Anytime you're cutting out waste, there's pretty much no downside to that. So this is a good example of, like, a good positive spillover effect. Yeah. Do you know what I do is I think about the electronic meter on the side of your house spinning, and literally every time I turn things off and follow Emily around the house turning things off after she turns them on, I literally think about the meter slowing down. And it makes me, like, breathe the sigh of relief as the meter breeds the sigh of relief. I know it sounds silly, but no, it doesn't. I really think about that thing turning down and you just go, oh, yeah, that's much more like it. There is an invention out there that is made for you. It's pretty new, but I believe it's on the market. You can plug it into an outlet, and what it does is eavesdrops on your electrical use and it can actually sort out what's doing what. Wow. But the readout shows you how much electricity you're using, and I think you can convert it to like, a dollar amount, too, or something. And the whole point is if you see how much you're using, you'll want to decrease it. So you would love this thing because it would show a decreased amount every time you turned off a light or unplugged something. I would be stressed about that being plugged in, though. Yeah. We talked about vampire energy earlier. That's the things that you leave on standby power overnight or pretty much all the time. The average house uses $100 to power devices that are turned off each year, $100 to power things that aren't even on that's money that you can use on, and like your little smartphone plug, even if your phone is not plugged into it, it's sucking energy. Well, plus, it's a bad idea also to charge your phone overnight because it's bad for your battery, typically to overcharge it. Yeah, it's a good idea. And then annually in the US. Vampire power costs $10 billion all over the US. Each year. Yes. So that's pretty substantial. If you pull everyone together. Sure. If you divide by 300 million, that's a lot of money in your pocket. So what do you do? Set up a charging station, which is what I have at my house. Put that all in a power strip and turn that power strip off and unplug it even better. And then just shoot it with a gun. Shoot it with a gun. Like the TV on it. And I hate all those lights anyway. I like to sleep in darkness. And if you look in your room, you probably have, like, three or four lights that are just on, like, your cable box. They're probably affecting your brain in some way. At the very least, they're affecting my wallet. So household energy, that was pretty good stuff. Yeah. By Energy Star. Yeah. There's a lot of rebates out there right now. The government has put, like, a huge push behind getting people to have more energy efficient stuff. Yeah, it's got $150. If you just look for the Energy Star thing when you're buying an appliance or something and then go online before you buy it and see if there's a rebate. Because basically it's just like if you got it on sale, this is an extra $50, $100, whatever, that you'll get back in six, eight weeks just for mailing in a copy of your receipt. Why would you not do that? That's right now I think it's a good time for a break. Oh, yeah. Because after this, it's the home stretch, which includes health insurance, money saving tips, and then a few tips from your older buddies here about what you can do with that money you're saving for your future. Yeah. Hey, everyone. When you're running a small business, every second counts, and you can't afford to waste a single moment. So why are you still taking time out of your day to go to the post office? And you could be using stamps.com. Yeah. For more than 20 years, stamps.com has been indispensable for over 1 million businesses, because stamps.com gives you access to all the post office and ups shipping services you need right from your computer. That's right. You can streamline your shipping process with stamps.com easy to use software. All you need is your regular computer and printer. No special supplies or equipment necessary, and you can get discounts you can't find anywhere else, like up to 30% off USPS. Rates and 86% off ups. So stop wasting time and start saving money. When you use stamps.com to mail and ship, sign up with promo code stuff for a special offer that includes a four week trial, plus free postage and a digital scale. No long term commitments or contracts. Just go to stamps.com, click the microphone at the top of the home page and enter code stuff. All right, really quickly, before we get into tips, I looked up insurance a little bit, because, like a dummy in my mid 20s, when I didn't have anything other than waiting tables jobs, I skipped on insurance because I didn't want to pay a couple of sure. So I got to thinking today, here's an older dude, how much it costs to stay in a hospital. The average cost of a hospital stay in the US. Is about $1,600. The average hospital, the median hospital stay in the USA, it's three times more than other industrialized countries, which is a whole different thing. But $18,000 is the average median stay in a hospital. The obamacare is coming out next month, and I think the average mid tier insurance policy will be about $325. So you would have to pay on that insurance policy 55 months, four and a half years to equal out one hospital stay. Wow. One bout of something. One bad car wreck. Point is, you're not doing yourself any favors if you think you're saving by not paying insurance. And I know when you're 23 and 25, you don't think anything's going to happen to you, but you are screwed if it does. Sure. So just be smart, get insurance, and you're covered. Yeah. Unless you're Ned Flanders, and then you consider it a form of gambling. Yeah. So insurance, that's a good one. Yeah. And like I said, if you don't have insurance I agree with you, Chuck. Health insurance is a good way to go if you already have insurance, car insurance, any kind of. Insurance, check out if you have a Svelte coverage, right. And then try to save some money without shooting yourself in the foot over time. But, yes, going without insurance is not a good way to save money. A good way to save money is to possibly look at your cell phone bill and say, do I need the plan that I have? Yeah. Do I need all those unlimited texts? Or see how many texts you send a month on average. Right. You might be able cut it back a little bit. Yeah. That's another good point. You keep raising, like, all these awesome points that deserve elaborating. But the first step to all of this is to write down your monthly expenses, track them for a little while, and you'll see where your money is going just right out of the gate. A lot of stuff will become obvious. That where you can turn. They totally will. Right. But the second step to that is to look at all the things you're currently paying for that you're like, okay, I need all this, and figure out ways to trim them individually. So whether it's car insurance, whether it's your cell phone bill, there's always a way to cut it down a little bit. That's right. Living debt free is something we believe in now. After incurring credit card debt for a number of years, we got rid of it all and haven't used credit cards in, like, eight years. Oh, yeah. We just can't afford it that month. We don't get it. Do you use the credit card to get it and then pay it off, though, just to keep your credit score up? We run everything through our American Express okay. Which we pay off each month. Right. Well, this article makes a really good point. Like, if you are having to pay interest on your credit card, that means you're buying things that you can't afford and you pay interest on your credit card. When you buy something and you can't pay it off at the end of the month, then it sounds like you have a very good policy going there. It's a good policy because when we looked at what we were spending on finance charges, it was ridiculously wasteful. Yeah. And it makes you angry when you really stop and look at it. Right. Because you work hard for money, you get taxed a lot anyway. The last thing you want to do is start throwing the man more money just because he said, oh, I got a little piece of plastic and go hog wild for a little while. Right. You don't have to wait for this. Just get it. Now, that's another good point that this article made. One of the things you can institute is a one month waiting period for all purchases, all major purchases. Any purchase you're excited about, you write it down instead of buying it, you just write down what you want. And then after a month, you go back to it and say, Do I still want this? Probably more often than not, you're going to be like, I don't even remember why I wanted that. Yes. Or wait for a good we do a lot of the financing deals. Like, I wanted a sound bar for the TV, and I waited like, a year to get it right. I waited till the right deal came along and a certain store had a 24 month no interest deal, and now I'm paying, like, $20 a month for it or something. But you got to be really careful. If you're bad about paying your bills, you can get jacked around on the finance charge, because at the end of 24 months, it's 500% interest. Yeah. Or if you miss a month or something, it's pretty ridiculous. Right. I recommend financing deals, but you just have to be really vigilant with your bills on time. Right. Another good reason to stop and wait a month, a week, whatever, if you just basically put a moratorium on any immediate spending, it will cause you to go poke around the Internet, and like you said, see if you can find a better financing deal. Maybe somebody else has it for less. If you do, use your credit cards. Some credit cards have deals with certain merchants to where you'll actually get some cash back, which is basically just like, money off, additional money off. There's a lot of reasons to stop and then figure out how you can get that thing you want for the least amount of money, which makes it even sweeter when you do get it. All right, dude. So we've given a lot of good little tips on how to save money. Yeah. You're saving some dough. Even if you're a millennial, pride yourself on saving a little money and not being wasteful. Yeah. Save what you can. Yeah. So what you want to think about next is, all right, I have a little extra change here. Now what do I do? Do I want to put it in a piggy bank or under the mattress or start investing in stocks or gambling on football? What should I do? Well, the first thing you want to do is to create a fund, basically an emergency fund. The rule of thumb is you have three to six months worth of expenses tucked away in a savings account that you can get to but you don't touch. Yeah. Just in case if you're laid off, something terrible happens, you have a significant amount of money that you can live on no matter what. You're not going to get kicked out of your home. You're not going to go hungry. That's right. That's pretty much the first thing you want to do when you're saving money. Like, as you're saving all this money and you're putting it away, that's the pot that you want it to go into. After that, you have a little more leeway to do things with, like you want to maybe pay off debt is a good second step. Yeah. Because if you're in debt, then you're wasting money big time and it's no fun to pay debt down, but it's super satisfying once you have it is. And it can be fun to pay debt down, especially if you're watching it climb down and get closer and closer to zero. And when you write that last check, you just like, I'll see you in hell, you're done. And from that point on, you've got an emergency fund, you're debt free, and then now you can do some fun stuff with your money. Yeah. You're on the right track at this point. Right. Hopefully by now you've got a budget that will work for you. The key with your budget is to do something that's reasonable for you that you can stick to. It's sort of like when I was reading about this, it's sort of like dieting. Like if you set yourself up for some stupid diet that you're not going to follow, I'm only going to have an apple and a can of tuna, like Kristen Bell and the machine. Yeah. Chances are you're not going to be successful. So it's really like dieting. It's more like a lifestyle change and finding whatever financial lifestyle works for you, where you're able to save some and still give yourself some things and have a little fun. Right. But the key here is to pay yourself first. If you're saving, the first thing you do is save when you get paid, the first thing, the first check you write, the first transfer you make, the first payment you make is to yourself. And you take whatever you budgeted for savings and take it from your checking account and put it in your savings account. Yeah. It doesn't exist. Exactly. That's the other aspect to it. Once you do that, that money does not exist. It's in your savings. It's not for you to play around with. It's not for you to be like, well, I went a little over on my credit card, so I'm going to use my savings. You went a little over on your credit card. That means you're going to have to pay interest on it that month because that money in savings does not exist. Yeah. And Josh will wrap your knuckles. He will come around. I'm getting very excited right now that the idea of going into your savings to pay off a credit card, you screwed up. That is true. So if you do have your budget working, you've got your emergency fund going, you're paying yourself every month, you're saving money, then you can start thinking about investments, things like maybe a CD, certificate of deposit. Nice low risk way to start if you're young. It's such a paltry amount right now. But still, I mean, you do get money back. Dip your toe in the water if you're reticent. And a CD is a good way to do it. So a CD is basically like you give some you loan money to a bank and it's for a set amount of time three months, a year, ten years, whatever. And basically the bank says, thanks for the money. At the end of the term, they give you back that money and then some interest for borrowing. So, like they put it in this article, your money goes away, and then when it comes back, it brings more money with it. It's pretty simple. Yeah. What if you're out there? All right? Josh, I'm a millennial. I just got through watching Girls. I'm drinking a Pim's cup on my sofa, okay? And I say, Josh and Chuck, this is great, but I've done these things. I don't make much money. I'm an artisan crafter of fine goods. I've only got $20 a week extra. There's actually a lot you can do with $20 a week. No, there's not. There is. Especially if you look at that $20 as part of a stream of $20 that you'll eventually have that you say want to invest. All right, what can you do with $20? Well, there's this cool thing called a Drip. It's a dividend reinvestment plan. You can also look into direct stock purchase plans, but basically you are going to a company that you believe in. You say, I have $20 and I want one share of your $20 stock. Right? And they say, okay, here you go. It's basically like a counter where you go and buy a stock from the company directly, which saves you on brokerage fees. So what you're saying is you can just invest a little bit into timing directly into these companies, which all adds up, and before you know it, you've got like a couple of grand invested in this company, right? There's supposedly about 1000 companies in the United States that sell stock directly. You don't have to go to an online brokerage. You don't have to go to your brick and mortar brokerage. The company's like, we're not going to charge any fees because you're giving us money for our stock. We're happy to sell it to you. And you are just kind of building up a portfolio on your own. It's a good investment if you're just going to sit on something. If you're day trading, that's the worst idea ever. I don't think you could do it like that. But if you just wanted to build up stock, if you say, I really believe in this company's future and I want to have this stock 50 years from now, why just say it's only $20. Instead, take that $20 and buy one share of stock. Yeah, that's one thing you could do. If you've got a few hundred bucks, maybe you could consider something called an index fund. Traditionally, an index that tracks the SRP 500 is going to return about 10% a year. That's pretty good. Not bad money. No. And you don't have to invest like, ten grand to do so. The other thing about an index fund is if you were buying compared to a mutual fund, it's an unmanaged fund. There are 500 stocks that you own, a percentage of in shares and the S Amp P 500 companies, and basically what you're doing is investing in the market itself. Right. So it's unmanaged, which means that the fees associated with it are next to nothing. If you have like, a mutual fund that's managed, they don't typically pay off as well, and you're paying a lot more in management fees. There's a really good, I think, frontline episode on index funds that came out this year that's definitely worth watching. And I'll bet you can get it for free online. If you have a little bit more. Let's say you got $500. What that's going to do is just open up your options a little bit. You're going to have a pick from different companies, some of which might require a minimum of, let's say, $500. So it just opens your investment options a little bit. You can shop around some. You might want to open what's called a discount brokerage account. Yeah, it's just basically like an online stock trading platform. And they're very cheap because they don't trade in microseconds or anything like that. It's just like this is where you buy stock for as cheap as it comes. Pretty easy. Yeah. If you've got a grand lying around, then, buddy, you are in the catbird seat. If you start with $1,000 and invest an additional 1000 each year, you earn about 10% annually. And when you retire, that money is going to turn into over half a million dollars. Yeah. And that's just a pretty standard, like IRA, right? Yes. Speaking of IRAs, if you work for a company and they match, if they do 401K matching, you want to do that because what that is, is your company giving you free money. There's no other way to put it. It's free money. Like whatever you contribute, they'll match like, say, 100%, up to a certain amount that you contribute. That is literally your company saying, here's some extra money for your retirement. It's what companies came up with to replace the old retirement plans that they used to have in the heydays of the unions. This is what we have today. So if you're not taking advantage of that, you should. And there's another reason to take advantage of a max it out, frankly, because it's deducted pre tax. It actually lowers your adjusted gross income, which means you'll pay less taxes the more you contribute to your 401K over the year. Boom. Yeah. You should be a financial planner. I am. For yourself? No, I've been doing it on the side. Oh, really? Yeah. There's this alley that I set up on a couple of garbage cans. People drop to the cans. I am fascinated by the stuff. Once you start to really get into it and think about it and look around at ways to save it's. Addictive. Well, I can say this. Warren Buffett didn't become Warren Buffett by being disinterested in finance. Right. Yeah. He probably thought it was pretty neat early on. Sure. And look at him now. That's where you're headed. I don't know about that. That's not, like, my primary interest. I just find it fascinating. Sure. What else, chuck, you got anything else? I have something else, actually. This is just a total overview, just some starter ideas that was definitely not like a full rundown of 401 KS and tax savings and that kind of stuff. Whatever perks your ears up, go look into it. Go do a little research. There's so much information online about this stuff that it's just basically a never ending supply. This, like, free financial information probably rivals cute kitten videos and just the sheer volume of stuff on the Internet. Yeah, sounds good to me. Yeah. Get into people. You'll thank us later. Okay, that's it for this one. Yeah. All right. If you want to learn more ways to save money, you can type in ten easy ways to save money in the search bar. Howstofworks.com? And we wish you the best of luck in becoming financially free and sticking it to the man. Yeah. And since I said search bar, it's time for listener mail. That's right. I'm going to call this one of our better emails about our Death podcast, dying Podcast. We heard from a lot of people that really got a lot out of this one, and it was very rewarding for us. So this is from one of them. Okay. Hey, guys. My mom passed away two years ago and was moved to hospice for the last two weeks. It was a very painful time for me, and I was nervous about listening to this podcast. In fact, I was in two minds about skipping it. However, I'm glad I did not skip it. My mom went through each stage as you described. This is the first time I've experienced anything like this, and it was horrible to watch. I thought she had died in a lot of pain, struggling to breathe and having to fight every step of the way. I now realize she was going through the normal steps, and I really wish I would have known this at the time. I can confirm that sound is the last thing that goes. About half an hour before she died, me and my sisters asked the nurse if there was anything we could do to help her, and she looked like she was struggling to breathe. The nurse suggested putting on some of her favorite music. Not only did this seem to calm her down, but after a while, we noticed that her breathing noises started to match the rhythm of the music. Was she trying to sing along? We think so. This is one of the good memories I have of her last week, so I'm glad we did it. I just thought I would email to say thank you for doing the show. Even after two years, it still distressed me how my mom died. And now I feel like I finally understand it and it's a big weight off my mind that she didn't feel as much pain as she looked like she was in. Well. So that is from Philippa Griggs in Norwich, England. Thank you very much for sending that in. That is very something else. Yeah. Or maybe it's pronounced norch. Norwick. Sometimes c H is a sound. I think it's Norwich. Norwich, England. Thanks, Philippa. That's a cool name, too. Yeah. Thank you very much for sending it in. Thanks to all of you who wrote in about our dying podcast. We really appreciate it. If you want to let us know something we taught you that meant a lot to you, we always like to hear that. You can tweet to us at syskpodcast. You can join us on Facebook.com stuffyoushenknow. You can send us an email to stuffpodcast@discovery.com. You can come hang out with us at our home on the web stuffyoushouldnow.com. For more on this and thousands of other topics, visit houseofworks.com. Brought to you by Toyota. Let's go places. Hey, it's summer, everybody, which means school's out. The sun is shining, the daylights longer, and best of all, there's plenty of time to get lost in a good, thrilling story. So whether you're road tripping or relaxing poolside, tune into the podcast series on Amazon Music. My favorite murder from exactly right media. My favorite murder has something for everyone. Hosted by Karen Kilgarriff and Georgia Hardstark, this true crime comedy podcast will share stories that will have you wanting more before you know it. Listen to new episodes of my favorite Murder. One week early on Amazon music. Download the free Amazon Music app and listen today.", "author": "sysk", "guid": "od42oizf7s-95a1-4b9f-b983-31689618b949", "url": "https://chtbl.com/track/5899E/podtrac.com/pts/redirect.mp3/traffic.omny.fm/d/clips/e73c998e-6e60-432f-8610-ae210140c5b1/a91018a4-ea4f-4130-bf55-ae270180c327/5d107957-01ef-4928-9c80-ae28009d3467/audio.mp3?utm_source=Podcast&in_playlist=44710ecc-10bb-48d1-93c7-ae270180c33e"}, "2": {"body": "I was in the at and T store for an upgrade. I left with at and T's best deal on a smartphone and a choice of plan. But on my way out, here comes this new guy, a noncarrier phone and a plan that raised eyebrows. I felt for him when I tell you we left the store store grinning from ear to ear with the same deal. I love watching people prosper. You feel me? That's when I learned that whether you joined today or have been with at and T for years, they'll have the same best deals for everyone on every smartphone. Eligible plan required. Offers vary by device. Restrictions may apply. See att. Comdealsfordetails. Hey, everybody. If you want a great website, you want to do it yourself with no Muslim fuss, turn to Squarespace. They have everything to sell anything. They have the tools that you need to get your business off the ground, including ecommerce templates, inventory management, simple checkout process, and secure payments. And if you're into analytics, hold on to your hats, because Squarespace has everything that you need. Just head to squarespace. Comcysk and you can get a free trial. And when you're ready to launch, use offer code SYSK to save 10% off your first purchase of a website or domain. Brought to you by the Reinvented 2012 Camry. It's ready. Are you welcome to stuff you should know from housetopworkscom. Hey, and welcome to the podcast. I'm Josh Clark. There's charles W, Chuck Bryant. And since we're here together, you can't see us, but we are here. Don't be so solid system, I swear. Thanks. Did I get that all right? I think so. Okay. It's stuff you should know. Yeah. Here we are. How are you doing? I'm great. Oh, I'm glad. I like these little top tens. I think they're a nice digestible light form of hey, I'm going to tell a couple of these at the next dinner party I throw. Yes. They're like or dervs. Yeah, exactly. They're like pigs in a blanket. Yeah, good. Homemade pigs in a blanket. They're like cocktail wheaties in that particular barbecue ketchup mixture. Yeah, that stuff. Yeah, they're all that more chunk. That's right. I've got one for you. Let's hear. We're talking about ten accidental inventions. Yeah. And I know we've talked about this a lot, but I think it bears repeating. The accidental discovery of LSD of acid. Yeah. Probably one of the funniest things that's ever happened to a chemist ever. Yeah, sure. Albie Hoffman, back in, I think, like, 1929, he started working at Sandos Pharmaceuticals in Switzerland, and he decided he was going to get to the bottom of Argott and ergot. It's a mold, I believe, or fungus. I'm sorry, that grows on rye in particular, and has long been known to make people do crazy, weird stuff. And they think that maybe the Salem witch trials were the result of ergot poisoning. Sure. Or the Enlightenment was the result of air got poisoning. It's possible. A lot of quote unquote poisoning. Right. Ergot craziness albie Hoffman is trying to albie? Like albie? Yeah, he's dead. He can't hear me. Okay. He was trying to figure out what you can do with this. He's been studying it for a while, and he came up with lysergic acid diplytomide, and he made several attempts at it. And on his derivative LSD 25, he got some on his hands, I guess, ingested it somehow. Yeah, fingertips. So he has it on his fingers? Yes. And he goes home to lay down. He starts seeing, like, fractals and colors and a kaleidoscope. And it interested him, I guess you could say. Sure. So he started researching heavily, like injecting it and getting bike rides from his assistant and all that stuff. Yeah, he took it on accident, and then three days later, he was like, Maybe I should try that for real. And then he got a ride home on the bike from his assistant. And April 16 is now referred to as Bicycle Day. About those hippies. Yeah. And one of his quotes that I thought was really great when he first described it, he said it was, quote, a not unpleasant intoxicated, like, state. Yeah. And that was on the first time. Apparently the bicycle trip got a little hairy. Oh, really? Yeah. But then he passed through that wave into the wave of not unpleasant once again. Right. And then he started wearing Captain. So it was an accidental discovery of the nature of the psychedelic nature. And he said we should start using this stuff for, like, medicine. Yeah, well, the hippies had other ideas. Yeah, sure. He ultimately referred to LSD as his problem child. He wrote a book called My Problem Child in I think it was kind of one of those ones where it's like, you're my problem child. Come here. Here's some money. He wrote that 1980? Wow. Yeah, I believe so. Boy, I didn't realize he lived that long. That's pretty cool. Yeah, he was an old guy. Well, I mean, he drank a tablespoon of LSD every day, and that's what gave him his longevity, I think. So that's number one, right? Or that's actually number ten. That was the intro. Well, it counts. I don't think it should count. So you got another one then? An extra? Yeah, I'll just make it up, apparently, is what we do. Josh number nine, Cornflakes, is fictionalized in the TC. Boyle book the road to wellville, was that a TC? Boy? Yeah. I didn't know that. He's great. Oh, I love him. Did you see the movie? Yeah. I've not seen the movie or read the book. Yeah. Matthew Broderick, Anthony Hopkins. Yes, it was good. I've been to Battle Creek before then. Oh, you really have? Yeah, when I was a kid. And that's the home of cereals, right? Kellogg's Cereals, basically. Kellogg's Cereal. Here we go. Wilkeath Kellogg, he was interested in medicine and he was working as a doctor at the Battle Creek Sanitarium with his brother, helping him out with and this is in the movie with their diets. He was trying all sorts of weird treatments. Big on animals. Oh, yeah. Huge on animals. He also discovered or created the first acidophilus, soy milk. Oh, really? Yeah, and some sort of meat alternative that ultimately led something to something like American Tofu or something. Yeah. Boy, what a genius. And he is responsible by accident for cornflakes. Oh, will was and I'm sorry, John Harvey, his brother, was responsible for those two things. Well, it runs in the family. Yeah. He was making bread one day at the old sanitarium there in Battle Creek. He left boiled wheat sitting out for a little too long. And he came back and he rolled into the dough and it became flaky, which is not what he was looking for. But he was like, you know what? I'm going to throw this in the oven. Anyway, let me see what happens. And it baked these little flakes that the patients here were like, boy, these are delicious. We should pour some milk over this stuff and cut a banana into it. Yeah. And put it in a box. Can we get some free striped strawberries added? Exactly. And eventually he tinkered with it and switched it over to corn as the main ingredients of wheat. And that was cornflakes, my friend. That's how I took off. What's he added or used corn? I'm sure it was kind of like, this isn't good, but what is this weedies? These are terrible. Yeah, exactly. And then he tried it with corn and they were like, oh, that's really good. And that formed the Battle Creek Toasted Cornflakes Company, which eventually became Kellogg's accidental serious whenever he came up with the Battle Creek Toasted Cornflakes Company name. Yeah. You know, he's wearing spats. That name just like Scream spats. What are spats? The little white covers that go over your shoes. Yeah. Like Mr. Monopoly or Buster. Still learning that terrible movie gangster. Yeah. Oscar. Yeah. I thought stats might have been the little sock leggings, but those are probably just called socket leggings. I think those are called spenders or garters. Yeah, we should bring that back. No, this died out for good reason. All right, moving on. Or do you have any other Kellogg's fax? I have neither Kellogg's fax nor anymore spats jokes. So I think we should go on because this next one is dynamite, named for the Greek root meaning connected with power. Alfred Nobel, Swedish scientist, accidentally discovered dynamite when he was working on basically with nitroglycerin. He's working on explosives, trying to make it stable. Well, his father built mines. Is that how that started? And you build mines using explosives, specifically nitroglycerin. But back then it was kind of like, okay, 80 people died because of nitroglycerin. Just exploded because someone looked at it wrong. Well, because we have it in a jar in the back of a horse cart. Right. That's part of the problem, too. But he lost a brother and three other people at his lab in Stockholm when he was trying to figure out how to stabilize it. Very sad. But he kept with it. And so in the article, it says that he was transporting it and saw it packed in this stuff, this mud that we like to call keeslegur. Yeah, right. But I read elsewhere that it wasn't that ultimately he came up with using Keysl ger. Yeah, I read that he dropped it on the sawdust. That's what I read. He thought he was going to die as he watched this vial fall of nitroglycerin fall out of his hand, but it landed on sawdust and was absorbed. And he went, that's weird. So he started studying. If you mixed it with an inert material, you could conceivably blast it by adding a fuse to it. He finally came up with Keysel Ger, which is like this it's like sedimentary mud. Right? Yeah. It's real powdery. It's a combination of crushed fossil and marine life. Got you. It's what they use actually, you'll probably see it. It's what they use on film sets when they want to make stuff look dirty. Oh, okay. Because it's just, like super light and powdery and makes it look really super dirty. Got you. Yeah. Keel ger. Yeah. Fuller's earth. Well, he also there would be something. He figured out how to stabilize nitroglycerin and created a stable explosive. Sure. But he combined it with another previous invention of his based on the initial ignition principle, which is not just using a fuse, but having a fuse go to a blasting cap and having a smaller explosive blow up your bigger explosive. Yeah. He put all that together. And that was dynamite. Truly dynamite. It was. Again, he was doing this to build minds. But in his lifetime, he saw his invention used to destroy human lives. Yeah, he blew up a lot of things himself by accident. A lot of his factories. It wasn't just that one time. No. Yeah. They basically said, you can't do this anymore on the mainland. So you started working on a barge. Yeah. And I think the barge might have even blown up. I'm sure everything blew up. He was like King Midas, but everything exploded. That's right. So as part of his legacy, he created the Nobel Peace Prize. Right. Well, I guess he bequeathed it to basically say, hey, a lot of people have died because of my invention, so let's promote safety and harmony and peace. And then later the IG Nobels. Yeah. Which kind of brought it full circle, in a way. They did. He first named it Nobel's Blasting Powder. Then eventually it became dynamite. Not to be confused with TNT. It's different. Okay, so AC DC was wrong. TNT I'm dynamite. It's not true. I know what you're saying. What they should have said was TNT, I'm not quite Dynamite, or I'm less effective than Dynamite. That should have been the song. So what is TNT then? Dynamite is 60% greater energy than TNT. Wow. So it's two totally different things. It's not just like a lesser degraded version. They're both high explosives, meaning they detonate instead of, like, burning. Yeah, but yeah, two different things. So Fan Scott, he was on the drink, as we all found out. Really? Like, he died because of the drink. The dude with the hat? Yeah, that's the second guy. Brian Johnson, the first lead singer for the first however many albums died in his car. He passed out after a night drinking and did the old choke on the vomit thing. But he was the one that sang TNT Dynamite. I thought those two guys were like, what? I thought TNT and Dynamite were up until a minute ago. Now. Brian Johnson came along later. Back in Black was his first album, so all that good early AC DC ponscon. What do you think about Sammy Hagar? A summer is here, my friend, which means school is out, the sun is shining bright, the days are longer, and best of all, there's plenty of time to get lost in a good, thrilling story. Yeah. Whether you're road tripping or you're relaxing by the pool, you can tune into the podcast here. It's on Amazon Music that's so good, it's criminal. Morbid. That's right. It's part true crime and part comedy. Morbid takes you on a journey through murderous mysteries and major laughs, all in the same week. Yeah, from the paranormal to the pretty spooky and everything in between, hosts Selena Erkhart and Ash Kelly cover it all. And with two episodes released each week, you'll be hooked on this chart topping series before you know it. You can listen to new episodes of Morbid one week early, only on Amazon Music. Download the free Amazon Music app and listen. Today whiskey are a major transit system with billions of passengers taking millions of trips every year. You aren't about to let any cyber attacks slow you down, so you partner with IBM to build a security architecture to keep your data network and applications protected. Now you can tackle threats so they don't bring you to a grinding halt. And everyone's going places, including you. Let's create cybersecurity that keeps your business on track. IBM, let's create learn more@ibm.com. So Saccharin is up next. Chuck, I feel like we should talk about Saccharin. Let's do it. Well, we are just really going down the line here, aren't we? Yeah. It's an accidental invention. Number seven. Okay, there's a guy who is named Constantine Fallberg. He's a chemist working in the labs at Johns Hopkins under a guy named IRA Remsen. Yeah. IRA calls Constantine a jerk. He does, but not quite for the reasons that are displayed here. Right, so Falberg and Remstone are working on, apparently substitute for coal tar. That's all I could come across. That's what I did. His quote, he was saying, like, I've made many discoveries in my search for coal tar, some of them accidentally, and here's one, but he doesn't say, like, what I was doing was synthesizing chemicals in a search for substitute for coal tar. So I'm not going to stand 100% behind it, but that's what I think. Right. He said he was in a great hurry and left the lab without washing his hands. Apparently, he wasn't wearing gloves or anything either while he was working in the lab with these chemicals that he didn't know what they were. And he went home and he ate dinner. Right. And he was eating a piece of bread, and his bread was really sweet, and he realized that that was weird. So he put the bread down and wiped his hands in his mouth and his beard with the napkin. The napkin is sweet. Yes. He thought the napkin was super sweet. And he's like, okay, there's something weird going on. He put two and two together and realized it must have been that powder that he had on his hands from the chemical that he spilled on it that he didn't think to wash off before he ate with his hands. Exactly. And it turned out to be Saccharine. So what does he do? Well, he says, I can probably make some money off this, and I'm under the impression that he shut out Remsen. So what he did was Remsen was a total research. He was a total lab rat. He didn't care a thing about patents, and he was apparently fine with the idea that Falberg went off and independently patented it. Until it started making money. No, until he started telling people that he was the one that created this thing. He was the senior researcher right then. Now he's screwing with Remsen's lab rat status. That's when Remsen was like, Shut your mouth. So it didn't have as much to do with money. No. His rep. Exactly. Interesting. Yeah. So Falberg ended up with the patent for saccharin, and years and years and years later, the 80s happened. People are all coked up. They're looking for ways to lose some weight, and Sweet and Low comes along. It's saccharin. And it has so few calories in it, apparently five calories a gram that it's just listed as zero calories because those packets are a lot less than a gram. Yeah. And the reason why it's non caloric is because it's never metabolized by the body. It just goes out the way in the same format came in. Yeah. It has zero food energy value. It's like if you were trapped, freezing in the woods and you had a big bucket of Sweet and Low, it wouldn't be the same as if you had a big bucket of sugar. Yeah. You'd want the big bucket of sugar trapped in the woods with a big bucket of sugar, huh? Well, you get food energy. Okay. Trapped in the woods with a big bucket of sweet and latter you're screwed. Yeah. Can you imagine, like, the fuzzy jackets on your teeth after eating a bucket of sugar in the woods? Since it was brought on the scene, it's kind of been added and removed quite a few times, too. You can eat this, it's fine. And it's probably not great for you list, but right now it's in good standing. It is approved because I remember in the late eighties, early nineties, like after everybody had been drinking it for a while, they took like a hard look at Saccharin and we're like, well, it may cause cancer in laboratory. I put it in my unsweet iced tea I've seen because that's the only thing I can find, that you put sugar in there and it just sinks to the bottom. That's why you have to use simple syrup. Yeah. Or put the sugar in the hot brewed tea where it will melt. But if it dissolves, if you're not going to do that, then you simple syrup is fine. It works really well. Or just drink unsweet tea, for God's sake. I'm on an UN sweet tea kick right now. A little lemon. Yeah, see, I like the sweet tea. Or if I drink green tea, obviously that's just straight up. Yeah. Not the same. Have you ever had this oolong tea? Yeah, sure. Yeah. That is something OOlala. It's crazy. All right, Josh, I didn't think the microwave I feel like we've talked about that before, like 800 times. We have, yeah. So let's skip it. Okay. Viagra? Yeah. I hadn't heard of this one. I didn't realize it was accidental. You haven't heard of viagra? Please. I've heard of Viagra, yes. I haven't heard of the story behind it. Got you. I see what you're insinuating. How's McCoy, Simon Campbell and David Roberts were researching for Pfizer, trying to develop some blood pressure and heart medication for angina. And they tested it on people doing some trials. And these guys were all like, I still have some angina and I have a massive erection, which is a weird side effect. You might want to look into this. Yeah. And they did, and they went, wow, this could pay dividends in the invalid. Yeah. They basically said, okay, FDA, forget everything we said, forget the angina. We're just going to stick to amyl nitrate. Yeah. Instead, we're going to start over, do more clinical trials, but we're going to use to treat Ed and we're going to target handsome, salt and pepper haired men of a certain age who like to bathe in bathtubs outdoors next to their partners who are also in bathtubs watching sunrise. That is our target market. Yeah. It's all the same, though. I wonder if it is all the same. You probably just got a suit by the pharmaceutical. Actually, they're not all the same. Each one has different covalent bond. I'll bet it's covalent bond. Well, they just have different properties. Some work for 24 hours, some work for 2 hours, some you take every day just in case you happen to run into someone and need to have sex. That's right. But all of them, no, preupism is not funny. I don't think it's funny because it's not. No, of course not. Okay. It's not. But it was popular. Sales peaked, I think, in 2008 at $1.9 billion in the US. Alone. Since then, obviously, Viagra was the first on the scene, but it has been chipped away at by its competitors. Like who? Cialis? And what's the other one? Davitra? Or is that heart medication? I can't keep track. I think we found that there's a fine line. Yeah. Anyway, this was originally for the treatment of angina. It works. Sure. I think that happens quite a bit, actually. Well, it's all about blood flow, so yeah, it makes sense that it had that side effect, I guess. It's all about blood flow and self confidence. That's right, Pacemaker. I thought this one like my eyes started bleeding during this one. All right, we can skip it because as people know, when we do our top tens, we generally do like six or seven of them. We like to drive traffic to the site. That's right. Velcro. This one I have to give a shout out. I want to tell everybody. This is so amazing. So I first heard the story of Velcro when I was just a young pup. The story of Velcro? Yeah. You're aware, right. The real story. Yeah. Okay. Not the fake NASA story. No, not the NASA story. The George de Mastral story. He was a Swiss, swiss, I don't remember what he was, but he turned out to be a Swiss inventor, electrical engineer. Okay. And he was hiking the Alps with his dog one day and came home and there were birds attached to his dog. And he said, that is ghastly. He said, what's going on here? Why are these birds attached to my dog? I'm going to take a closer look. And he realized that the birds were composed of little hooks and that his dog's fur were acting as little loops, and the hooks went into loops and stuck and attached. And he said, I can recreate this. You know what I'll recreate it with? Nylon. And that's what he did. And that's what all Velcro is, a system of hooks and loops made of nylon. Now, I first learned that story when I was probably like, seriously eleven or twelve. And I read it in Uncle John's bathroom. Reader and every Christmas I would get in a Bathroom Reader, and every like December 29, I'd be done with the 500 page Bathroom Reader. Wait, another year. Yeah, a lot. Just for this reason, I would be reading this book over and over, just constantly. And so one of the reasons that we're here today one of the reasons I'm here today is because my curiosity was developed and honed through Uncle John's bathroom reader. Oh, yeah. Yes. And it's been good and bad. Like, they were also where I learned that Genghis Khan supposedly killed, like, 187 million people in 1 hour, which kind of led to that article and all that cool. But my eyes were open. We shouted out to them, like, recently, and they tweeted that we shouted out to them, and I realized that they listened to this podcast. Wow. That's pretty cool. It's, like, the highest honor I have ever enjoyed as far as my career goes. That's awesome. That was it. This group that made me, in part, in large part, who I am today is a fan of what we're doing. That's awesome. Yeah. I imagine Mad magazine could only come close if they got in touch with you. Yeah. They would definitely be out there as well. That's awesome. Okay, so that's velcro. Yeah. And a couple of more little factoids. It's a combination of two French words velours, which means velvet, and crochet, which is hook. Yeah. And velour does not breathe very well as a fabric. That's right. Nylon was very new at the time, so he had a hard time with it. And this is a lesson for all your kids out there who fashion yourself or fancy yourself. Excuse me. As the inventors, don't give up. It took him ten years from the moment he discovered what velcro could be till the time that he could manufacture it successfully. And he worked and he worked, and he worked. Ten years later, he marketed it as the Zipperless zipper. And the rest is history. And don't get cheap Velcro because you can tell the difference. Oh, man, you really can. Same as cheap duct tape. You really get what you pay for. Yeah, that's definitely true. With duct tape. You don't want duct tape that doesn't have the threads clearly visible. Yes. That form, like, kind of almost the rebar of it. It's exactly what it is. If you can't see it clearly, like, in the role, then just keep on moving. Little advice from your Uncle Josh, but that stick to it advice. Yeah. Not the duct tape. Stick to it. Yeah. That was good advice. Decade of work. Penicillin. Yeah. This one I don't think I realized penicillin was an accident. Alexander Fleming, he was a bacteriologist in Scotland. He decided to get a little lazy and go on vacation for two weeks. Luckily for us, in 1928. Comes home, sees a petri dish with this weird mold that he hadn't seen before growing in it. And he noticed, like, there's no bacteria around this mold. Right. It was like, hugging the side of the pantry. Just like, Get it away from me. I know this stuff is killing me. And he went, Well, I might be on something here. Right. But the problem was the strain of penicillin mold that he discovered. He left his window open the guy was a bacteriologist in the 20th century and he left his window open. Right. Anyway, the mold, the strain he found was he couldn't reproduce it in mass quantities, so therefore, by definition, it was useless as medicine. Sure. And then 13 years later, a trio of guys, flora, Heatley and Moyer, found a strain of penicillin that they could just grow very quickly in large amounts. Bam. Antibiotics. Nice. Millions and millions, possibly billion LiveSave. The greed. But don't take too much of it. No, I think we prescribe it these days. You should always know your limits. Yeah. No, I'm just saying I think penicillin is one of those people get thrown up penicillin and amoxicillin for everything these days. Right. Well, the other part of the problem, supposedly, is that if you don't finish your course, that makes it that much easier for bacteria. Yeah, that's what I hear. Microbes to evolve immunity. Yes. I almost never finished my course, though. Because you're part of the problem. Gives me bad diarrhea. Well, you need to ride it out, as they say. Get yourself an Uncle John's bathroom reader. In fact, when I'm on pennicillin, for one reason or another, I call them diarrhea pills. I have to take my diarrhea bill because I take it and they say that's a possible side effect. But of course, with me, it's a certain side effect. At least you don't get preappresented from it. All right, number one, josh, the last one. I thought this was pretty interesting because going back all the way to the 1008 hundreds, we used to think people are all stuffy. Didn't know how to have a good time. All they did was just go to school, go to church, walk to work and study hard. Turns out that they were having laughing gas parties. Yeah. In Ether Frolics. Ether Frolics. Where they would sit around and suck on laughing gas and just laugh the night away. Right. Which is where the phrase It's a gas comes from. That's nice. That makes sense. Sure. You're big time into entomology, aren't you? Yeah. And entomophagy. Yeah, that's right. Hey, everybody. I don't know about you, but we're pretty excited about summer. I mean, what's not to like? School's out, the sun is shining, and best of all, there's downtime for days. That's right. And that's where True Crime podcasts on Amazon music come in. They're the perfect activity for last minute road trips, long walks, or, if you're brave enough, late nights. Yeah. And with so many killer shows like Morbid, My Favorite Murder and Smalltown Murder, you'll never be bored to death again. Prepare to go deep and become your own detective in the world of serial crimes and unsolved mysteries. Get lost hearing spooky stories with a combination of detailed research and lighthearted analysis. Whether you're a lifetime fan of true crime or you just feel like being entertained while doing the dishes at night, there's a podcast out there for you. So. Download the free Amazon Music app to start listening to all your favorite true crime podcasts. Plus, with Amazon Music, you can access new episodes early. Download the app today. What if you were a trendy apparel company facing an avalanche of demand to ensure more customers can buy more sherpa lined jackets? You called IBM to automate your it infrastructure with AI. Now, your systems monitor themselves. What used to take hours, takes minutes, and you have an ecommerce platform designed to handle sudden spikes in overall demand, as in actual overalls. Let's create It systems that rule of their own sleep. IBM, let's create. Learn more at IBM. Comitautomation. So what happened was anesthesia was accidentally discovered by it seems like a few different people realized about the same time from those parties. Yeah. Crawford Long. He's an Atlanta guy, right? Yeah, he's somewhere around Atlanta. Yes. William Morton and Charles Jackson and Horace Wells. They had all experimented with nitrous oxide. Maybe not. Went to some of these parties. I don't know if we can verify that. I have seen that they were at these parties. Okay. I went back in time and looked in the way back machine. At some point, someone said, hey, I just whacked my leg really hard and it didn't hurt at all. And it was bleeding. Yeah. And there was no pain experience from it. And I think it was Crawford Long. I was like, what do you mean you're not experiencing any pain? Do it again. Yeah, let me hold your ether for a minute. Yeah, exactly. And then they started experimenting with it. And I think Horace Wells used it for dentistry and I was using it for surgery. Yeah, for minor surgery. Carpet long, like amputations and stuff like that. Because this is at a time when it was like, here's your broomstick, here's your bottle of whiskey. Bite down on that, your leg off. And a skilled surgeon was quick. That was the definition of a skilled surgeon. Someone you could take your leg off in less than a minute. Well, I think your best case scenario is that you'll pass out from the pain, right. But they also loaded you up on, like, booze and drugs. Like you'd smoke a lot of opium first or take a lot of opium somehow. Right. So you just wouldn't really care. Got you. Have you heard about the flesh eating bacteria that's going around right now? Yeah, it's crazy. That's very scary. I better watch it out with the netty pots, dude. Yeah, actually, I haven't netted in a little while. Yeah. Just remember, still water and then maybe boil it already more. Boil it anyway, I suppose. Well, at the very least, I do a lot of camping and fishing and rivers. I'm not getting in with any open sore anytime soon. No, but that girl in Georgia, she was on a zipline. She fell and created an open source, aka a wound, and it got in there pretty good, apparently. Yeah. Emily and I've been following that story closely. That's like ever. Yeah, but she's got a great attitude apparently about it. Oh, really? Yeah, like her dad went in and said, finally told her we're going to have to invitate your hands, your other foot. After her leg was already gone, she was like, let's do it. So Yummy has been telling me about this and she was saying that they just got her fingers, that her hands are intact right now. I don't think so. Are her hands gone? I think so. Wow. Yeah, it's very sad. This one ended on a strange twist. I know. Wow. Do you have any more accidental inventions? I know you do, but don't say them. No, there's a few more. Go to the website and read all about it. Yeah. Type accidentalinventions in the search bar athousedupportst.com and it will bring up this fine article. There's actually a few articles that have similar ones, but different ones too. You'll just read them all, you love them. I said search bar@houseupworks.com again. Which means it's time for listener mail. Actually, wait, we can't do listening or mail yet. This again? Yeah. Okay. It's plug fest time. That's right. So, Chuck, we have a horror fiction contest going on, don't we? That's right. Real quick, give them the broad strokes. Well, if you're familiar with our Halloween episodes the past two years, we do readings from Poe last year and what's his face the year before that. HP. Lovecraft. HP. Lovecraft, yeah. And this year we want to read a story written by you, someone out there. So we are throwing a contest and Josh wrote a great blog post outlining the details. You can find out how stuff works. Yeah. You can go to blogs at How Stuff Works and it's called Stuff You should Know. Horror Fiction Contest. Get your official rules right here. Yeah, it's got everything you need to know on there. Everything. What's the highlight? Well, the highlights are that it started on June 18 and it runs until July 20 at 11:59 p.m.. It has to have been previously unpublished and that includes websites. If you put it up on your own blog, I think it's okay. But if you gave it to somebody else and they published it sorry. And it needs to be between 3004 thousand words, no more, no less. Okay. And this is really important. In the email that you send this in, you send it, by the way, to Howstaffordscorecontest@discovery.com. Okay. In that email, when you enter your submission, you need to write the words, by entering this contest, I agree to abide by the contest rules. Okay. Without that, we have to disqualify you. So that's basically you're signing off that you understand the rules by acknowledging that statement. Right. Okay. Go to the blogs and read the rules first. Take a quick glance at them. If you have a question, it's probably answered there. Yeah. And sadly, we know, and we understand that this is only for residents of the United States, and we're sorry, but that's just how it goes. I've said it a million times. We can't win your country's contest either. Right? It's just how contests work. Yeah. Pick it up with the contest gods. Yes. If you're 17, even if you're going to turn 18 within the contest, you're out of luck. You have to be 18 as of Monday, July or June 18. People don't like rules. No, they don't, but we're not making them. Got to have them. Yeah. So send it off. US and maybe a couple of other writers or editors will judge these things. We're going to select the top 16 and then enter them into a bracket contest. Then let the people vote, and then we pick the and then the winner is chosen, and we read it on Hard. Pretty cool. Yeah. All right, what else? We're going to Comic Con in San Diego for the first time ever. And Thursday we don't have the time yet, but Thursday, July 12, we will be doing a live podcast panel with special guests. Yeah. What are we doing it on? You want to say, or do you want to keep it a surprise? Let's keep it a surprise for now. All right, so, Comcon, if you're going to be there, come see us thursday afternoon, I think, right? Yeah. You'll be able to find out. We'll post it once we can reveal all the Tory details. Very cool. So there you go. That's plug fast. Now it's time to listen to me, right? Yes, Josh. I'm going to call this, what? Medical marijuana. And by the way, on email, I've been answering more and more lately because I've had more time, but still, if you write in and I don't answer, we have read it, I promise. And if you send in just a simple suggestion for a show, we log those, but you may not get the email back on, something like that. So just don't want anyone to feel bad if they emailed them we didn't respond. You're a valued member of our fan base. Okay. Medical marijuana. Your show on MMJ is what some people have been calling on. I always think it's like, Martin and you or something like that. It reminded me of a funny story I can share. During the early 80s, my father had a rare cancer. It's even rare these days from the surprise my doctors have when I give my medical history. At one point, my dad's doctor suggested he tried marijuana to help with the chemo sickness. Of course, there was no way to prescribe it back then. You had to get it on your own. My parents started asking around to see whose kids could get some trustworthy stuff. With no luck where we live, my mom turned to a relative who lives in another state. So clearly, like the stoner cousin, like, two states over. She could get it, but I don't know the details how. Probably for the best. Yeah. The next problem was how to get it to us. She often flew to visit every few months, but was afraid of putting it in her luggage or mailing it. Even though everybody back then, I bet. Yeah. So one of her coworkers had an idea. They worked in a doctor's office and decided she would hide it between her breasts and bandage her as if she had recently had breast surgery. She was sent with a note saying under no circumstances for the bandages to be removed. They thought that if she was hassled the airport, a note would get her out of trouble. They did this actually a few times and never got caught. Oh, my God. I know. Isn't that crazy? As it turns out, my father couldn't smoke the stuff. It made him sicker. Oh, my God. I know. So he decided to brew it in tea, and I'm sure there was a little baked snack put in his lunch bag every now and then. Unfortunately, my father passed away in 1084 when I was 16. I wasn't completely involved in all this other stuff. The stories were retold later. There are a lot of hijinks going on in the house over those years, so this is totally plausible. I remember vividly the little tee ball sitting in the sink when I washed the dishes every night, asking, can I clean this thing? And I would get a resounding no from about five people in the house at the same time. So that is from Cindy. Cindy Brady? No, not Cindy Brady. But she asked if I could read this, and she said yes. And then she wrote me back and said I ended up talking with my mom about this and we all had a good laugh all over again. And remember my father. Finally. That's nice. She said her mom ended up smoking some for her anxiety, so you should probably wipe your hard drive clean of that email less somebody sure the Feds come in and compensate your computer. Yeah, if you have a wacky family history story, those are awesome. Don't we all? That's pretty wacky, though, man. Yeah, it's like Little Miss Sunshine. Wacky. I haven't seen it, I just know of it. Funny. We want to hear it. So tweet to us at Syskpodcast facebook.com STUFFYou know or email at stuffpodcast@discovery.com. For more on this and thousands of other topics, visit houseofworks.com. Brought to you by the Reinvented 2012 Camry. It's ready. Are you? Hey, it's summer, everybody, which means school is out, the sun shining, the daylight is longer, and best of all, there's plenty of time to get lost in a good, thrilling story. So whether you're road tripping or relaxing Poolsite, tune into the podcast series on Amazon. Music. My favorite murder from exactly right media. My favorite murder has something for everyone. Hosted by Karen Kilguera and Georgia Hardstark, this true crime comedy podcast will share stories that will have you wanting more before you know it. Listen to new episodes of my favorite Murder. One week early on Amazon music. Download the free Amazon Music app and listen today. You know you're a pet mom when you plan your vacation around your pet at Halo, we get it because we're pet moms, too. We make natural, high quality pet food that's rooted in science. It's the world's best food for of the world's best kids. Learn more@halopets.com.", "author": "sysk", "guid": "od1j2agbqn-3b0b-4a57-bd32-83e9edbb4220", "url": "https://chtbl.com/track/5899E/podtrac.com/pts/redirect.mp3/traffic.omny.fm/d/clips/e73c998e-6e60-432f-8610-ae210140c5b1/a91018a4-ea4f-4130-bf55-ae270180c327/3e1256e9-20c5-4f88-98ea-ae2800a75adc/audio.mp3?utm_source=Podcast&in_playlist=44710ecc-10bb-48d1-93c7-ae270180c33e"}, "3": {"body": "Welcome to stuff. You should know a production of Iheartradios how stuff works. Hey, and welcome to the podcast. I'm Josh Clarke. There's charles W, Chuck Bryant. There's Jerry over there. This is stuff you should know. It's about people who have really bad luck. Nine of them. Yeah. I don't think we've ever done a full Top Ten list, have we? Yeah, that should be our last episode. Yeah, it's like stuff you should know is Ten biggest regrets. Right. That's a great idea. Yeah, that'll be the last one. All right, let's write that down. We don't have ten regrets. Yeah, I guess we couldn't do it full time. No, actually, we could probably come up with ten. No, we couldn't. VidCon number one. That's a big one. This intro is definitely up there, too, number two. So we're on our way. All right, good. How are you feeling? Pretty good. I'm great. You feel lucky, punk? I'm a pretty lucky person, I will say that. I would agree with that. Or good fortune. My friends have called me the Rabbit's Foot over the years. Yeah, that's why they're always rubbing you. But that's mainly for narrowly escaping trouble more than anything. How about a story Chuck laid on us? I was very famous among my group of friends for getting pulled over by police and not getting tickets. Right. I mean, at one point, it had literally happened, like, 14 times in a row or something over a span of, like, ten or twelve years. Okay. It happened a lot. And I didn't get my first ticket until probably in my mid 30s. What happened? Talk your way out of it. Yeah. You know what you do, man. And my brother always gets a ticket, and he's much nicer than I am. But you just got to be as humble, humble, humble, humble as you can be. And if you show the slightest bit of attitude, then that police officer, in my experience, will delight in writing you that ticket. Sure. I mean, even if it's a sideways look. And I basically just throw myself at the mercy of the court on the side of the road. I'm like, I'm so sorry, officer. You should have pulled me over. You did the right thing. I was wrong, and I'm sorry. There's no excuse. I was going to eat these crunch fries, but you should take them. You're the hero here. I think they're always a little disarmed, and they're like, oh, okay. Well, I guess I can let you off of the warning. I don't know. That's been my experience. All right, there's Chuck advice right there. Yeah. So you get out of 14 tickets. So did you forget to the last 15th time, did you forget? Did you sneer calling them a pig? No, I think it was just one of those things where they were writing the ticket even before I had a chance to do my little song and dance. And they brought me the ticket. And I was kind of like, oh, wait a minute. Don't you know who I am? I'm the guy that gets out of tickets. I thought you were going to say I'm Chuck from stuff you should know. No, that means nothing. That's how you get out on these days, buddy. Well, we're talking today about some people who have very bad luck. And a lot of these lists usually are just like, no to this one, no to that one. No, this is wrong. I think we tried to do a list once where, man, I can't remember which one it was, but every single entry was just false. Right? Yeah. That's only the case with like three of these this time, which I'm pretty that's not a bad batting average for a listicle. Yeah. And some of these are the word luck kind of bothers me sometimes because, as is the case, we'll go ahead and get to the first one, ron Wayne, who was one of the original three partners of Apple Computers. That's not bad luck. Ron Wayne made a poor business decision. That's a good point. Have you ever heard of Ron Wayne before? No, have you? No, I haven't. And had I heard his name, I would have been like, he sounds like porn actor, but he's not porn actor. Oh, no, that was another guy. I can't say his real name, though. Who I demand that you say I'll tell you off, Mike. Okay, so it turns out this guy was not a pornography actor. He was one of the three founders of Apple. And as far as I had known at this point, there were two founders of Apple. It turns out there were three at the beginning for the first twelve days. Yeah. So go back to 1976 in our way back machine, and nerdy little jobs and nerdy little wozniak are young guys in their twenty s. And they had this great they didn't know it at the time, or they may have known it or suspected, but this great vision for the future, but they were kind of kids and they didn't have any experience. So they look to a guy named Ron Wayne who was in his forty s to come in and kind of help what they called with adult supervision, because they were programmers from Atari. But yeah, they didn't have the actual business sense or whatever. And Atari was just a party job at the time. I believe so, yeah. But I had no idea Atari produced Apple, though, did you? Oh, yeah. I did a bunch of Atari research stuff for my tech Stuff guest spot. Okay, cool. Yeah, we did a history of Atari two partner. Oh, speaking of guest spots, man, let me just also give a shout out real quick. Sorry to interrupt this little entry, but I was on our good friend John Go Forth and our new friend Brent's podcast Hysteria 51, recently. Nice. Yes, we talked about the Fermi paradox for, like, an hour, and it was awesome. So go check that out. Hesteria 51. Go check that out. Okay, so plug out. Right? So we're in 1976 was and Jobs have recruited Juan Wayne, ron Wayne, to be the adult in the room to help with engineering documentation. And it was actually Ron Wayne who drafted the very first Apple contract and said, this is what they agreed on, he just make it up, which said how much everyone is going to get. He got 10% to Jobs in Wozniak, 45. And he even created the first Apple logo, which was not the logo we know and love now. It was like a woodcut style thing of Isaac Newton under the apple tree. Right. Not bad. Sounds terrible. I disagree. I think it sounds ugly. So Ron Wayne, while he was there, he very quickly was like, I don't know if this is my kind of place. I thought it was a good idea. I like what these guys are doing, but this company in a garage. Steve Jobs keeps taking acid during the middle of business hours. Did he really? Yeah. Oh, wow. Steve Jobs thought he was pretty cool, from what I understand. Sure. Ron Wayne was like, I don't think I fit in here. Also, apparently he was worried that he was going to have to pony up for whatever business debts they incurred. I think that was a big deal. And he was like, all right, I'm out. I'm out. Yeah, because he was an adult, and he was like, I've got a house, and I'm a real adult human. Like, they're going to turn to me, certainly when they need to go. So he cashed out in twelve days. Twelve days after they established their contract. And the contract was kept by Ron Wayne. Actually, we'll get to that in a second. But he cashed out for $2,300. 230,000, you say? No, 2300, which is still today worth less than, like, ten grand. And he didn't even get it all at once. He got 800 right then, and then he agreed to take 1500 later. And that was Apple went public, and everybody involved became an instant millionaire. And years later, it hit the trillion dollar mark for valuation. And all the while, Ron Wayne got to watch this company grow and grow and grow and realize that he'd sold off 10% of the stake in the company for $2,300. Yeah. And apparently, if he had held all those stocks, he'd be worth close to $100 billion. So he takes issue with that. He said he probably lost out on tens of millions. Yes. I guess it depends on what? Since you can't go back and do it all over again like Eddie Money says. Right. I guess there's always the thing of, like, well, yeah, but he always maintains, I would have gotten out after that before the big cash in anyway, probably. So I don't like to look at it is that sort of a loss? Is what he tells himself, basically, or else I would have gone totally insane a long time ago. Yeah, but he did, apparently. He wrote a Facebook essay and said, I probably there would have been around in 1980 and gotten some pretty good change and I think regrets it. Yeah. He said had he known that everybody was going to become a millionaire in four years, he definitely would have hung in there. But hindsight is 2020. Yeah. And the cherry on top here is pretty interesting, though. He said he kept that contract, that very first Apple contract that he drew up, and he kept it and he auctioned it off in the early 90s for how much? 500 simoleons. $500. And what happened? Not bad. It was just a piece of paper he had hanging around. Oh, sure. Somebody turned around and auctioned it off years later in 2011 for almost 1.6 million. Poor Ron Wayne. Now that one's bad luck. Wonder what he did, though, with his life. He wrote essays on Facebook. No, I mean, I bet he did okay. Yeah, I guess so. Steve Jobs okay, but I doubt if you, like, got a low wage, hourly paying job. I don't know. He became Eddie money's tour manager. Things worked out then. Every time Eddie Money saying, I want to go back and see here down Ron Wayne's face. That's right. So I think we should move on. We're going to leave Ron Wayne because also we should definitely tip our heads to anyone who faced adversity like this and was like, this happens, and had tipped to Ron Wayne for that one. And Hodges did not have that kind of experience. She is the only person, as far as anyone knows, the only human being in the history in recorded history of humanity to have been hit by a meteorite. I'm laughing and I shouldn't actually, she didn't get that hurt, so that's why I feel okay laughing. It's not like it fell on her head no. And killed her. It's November 30, 1954 in Alabama and an 8.5 LB meteorite came through her roof, bounced off of a radio and hit her in the hip. Yes. It makes you wonder, like, if she had been where the radio was and this wasn't like a bounce ricochet. Yeah, a ricochet. How much worse would things have been? Yes. Probably dead. I saw a picture on Reddit of her just randomly. We had already picked this episode and started researching, and I saw a picture of her bruise on reddit and it was pretty nasty. Pretty nasty little bruise. Yeah. But that was about as bad as it got physically. So she was laying on the couch, a meteorite came through her roof, hit a radio, hit her, and she became almost immediately a media sensation because we got out very quickly that a woman had been struck by a meteorite. Probably the first and only person ever. Yeah. And that's super rare. It's rare for a meteorite to fall just in an urban area where people live or suburban area where people live because they don't know. I would call Alabama urban. Yeah. I mean, it's just not usual. Like, usually meteorites, there's a lot of water on Earth. Usually they'll just land in the ocean somewhere. So it's big news if a meteorite hits anywhere near people, much less hitting a person. Right. There is a meteorologist named Michael Reynolds who told National Geographic, get this. He said, you have a better chance of being hit by a tornado, a bolt of lightning and a hurricane at the same time than you do a meteorite. I'm not sure how we actually quantify that, but that's one of the better quotes I've read in a while. Yeah. And this is where it gets this is just so America and USA is there was a court battle between her and her landlord because her landlord was like, that's my space rock because it's my house. And Anne Hodges was like, no, that's my space rock because it hit me in the hip. Right. And they went to court, and Hodges actually won and got to keep that, sadly, ultimately Valueless meteorite. Yes. She settled actually, she ended up paying the landlord $500 for the right to the rock. But by the time this was finally settled, two years later, they found out that nobody cared any longer. It was old news. So nobody wanted to buy the meteorite. And you might think, well, okay, it's not clear that anyone would ever wanted to buy the meteorite to begin with. Not true. They have a neighbor just down the road who had just the tiniest little piece of that space rock and sold it. At the time, this thing was a big media sensation and was able to buy a new house and a new car from the proceeds. So the Hodges were like, clearly, we've got the space rock. We're going to cash in. We're going to buy the state of Alabama with the proceeds. But two years later, it was totally valueless. And Ann Hodges actually just kept taking turns for the worst and ended up dying in a nursing home at age 49 after having a nervous breakdown from the whole ordeal. Yeah, it's very sad. But that meteorite is on display. The Alabama Museum of Natural History. And I hope that there is at least a small plaque that memorializes her. Surely there is, right? I would hope so. Yes. That would be a nice thing after a string of bad luck. It's pretty bad luck. Should we take a break? I think we should. All right, we're going to take a break and talk about the unluckiest person in the music industry right after this. Chuck, I have a tad bit of anxiety. No. Okay. I have anxiety about this one just because it's so rotten and rough. I feel so bad for this guy. Well, here's the thing. Before the break, I called former first Beatles drummer. Not former first, but former and first Beatles drummer. Pete Best, the unluckiest man in music. He's been called that. That's not true either. Pete Best didn't have bad luck. Pete Best didn't have good chops. Oh, is that what it was? Yeah. Okay, that's totally different. I didn't think it was bad luck necessarily. Obviously didn't jive with the group. But I thought maybe it was like he had to walk around being like, I have a terrible personality and that's why I'm not a Beetle or whatever. No, we'll get to that. So let's go back in time. Pete Bess in the very early days of the Beatles, in the 1950s, when they were known as the choirmen, his mom, he was a drummer, and his mom owns something called the Kazba Coffee Club in Liverpool. Cool. And she was cool. And she was very, like, ahead of her time as far as the Liverpool music scene, very much out in front of it. So it's the kind of deal where, like, well, pizza drummer and his mom owns a place where we can play I Got You. So he's in the band, and it's good because now we've got a place where we can gig and we got a drummer that can play. Okay. And he's handsome. That was a big part of it. Was he? Yeah, that was a big thing. Over the years, that was rumored that he was kicked out because Paul said he was too handsome and he didn't want any competition. Is he still around? Yeah, he's alive. Okay. I'm not going to say the next part then, I guess at the time the Beatles, by the time Pete Best was kind of brought on, he wasn't officially brought on as the Beetles. Beetles, as we think of them today, where there was four of them, there was like a rotating bunch of drummers. And Pete Best was one of those drummers, right? Yeah, but he played. I mean, he was sort of like when I rotated and stuff, you should know early on a little bit, there was still a rotation going for a short time, and I think and then everyone else just went away. Right. Like, Pete Best played, like, 80 something gigs with the Beatles prehamberg, I think. Oh, okay. And then they took them to Hamburg, which apparently was a big turning point for everybody. They paid, like, 80 shows a week in Hamburg. I saw a great quote in Hamburg is where the Beetles really started to become like the Beatles, like they coalesced into a band. I saw that they arrived wearing lilac sport jackets and trousers and left wearing black leather jackets and jeans. It's where they learned sex, drugs and rock and roll. Yeah. Pete Best wasn't into the drugs, though, like the other three guys. Oh, really? So that was a problem. Sure. That's a buzzkill. When the one guy in the room is just sitting there staring at you judgy. Yeah. Well, that's kind of a buzzkill, I would guess, right? Yeah, probably so. I think they were all doing Speed back then. Oh, sure, because they were playing literally like six or seven shows a night. Were they really playing that many? Oh, it was ridiculous. Wow. Yeah. So he was in a group called The Blackjacks before that, though, went to Hamburg with The Beatles, and then right after that, the Beatles go back to England in 1962 and they were just about to go into the studio to record their first singles for EMI, and legendary manager Brian Epstein called up and said, sorry, Bloke, the boys want you out. And it's already been arranged. Yeah, meaning like, don't even bother, it's done. Which is sad. And Pete Best took it pretty hard, from what I understand. In a horrible twist of irony, he ended up working at the unemployment office, but working there, not hanging out there. And by this time, like, he had made a name for himself around Liverpool as a musician and a Beatle. The reason why he's called the unluckiest man in music is not because he was a Beatle at one point in time, but that he was a Beatle at one point in time and was kicked out of the band a few weeks before The Beatles blew up. Yeah, and it almost makes you wonder, like, did they blow up because they moved out of Ringo, or was it like, that was just bad timing? Well, I mean, here's the deal. There are interviews out there with both John and Paul. There's always been a rumor, like I said, that Pete's handsomeness threatened the band. That is not true. Paul is on record as saying it's just something that happens early in the days of bands. Like, we were just really struck by how great Ringo was. Pete Best sat out one gig because he was sick or something. Ringo sat in and they were all just like, wow. They all felt it. And it was just sort of that magic happened where they were like, oh, boy, I know, it's got to happen. John, for his part, said it had nothing to do with his looks. He said he was just kind of a crap drummer. John was not the nicest guy in the world, so he really kind of threw it all on the table and was like, he wasn't a good drummer, he just wasn't. He was a good first drummer and clearly it was time to move on from him and it was mainly because his mom owned a place where we could play. Got you. Not very nice. Got you. No, but I mean, that doesn't make him unlucky. No, he didn't have the chops he's reckoned with it. I saw an article from last year where he was like, he never spoke to the other three guys again. And he was like, yeah, me and Paul, I'd love to sit down and have a scotch and talk about it. And he's like, the door is open. Oh, really? Yeah. I don't know if Paul is going to do that, though. Maybe not. He was on Howard Stern, paul was and Howard was like, you're just going to write him a check just out of guilt, he would have Paulson. He's just like, no. He did get royalties, though, later on when The Beatles Anthology came out, because that included stuff from Pete Best. So he ended up getting some money. He made that okay. Yeah. I think the lesson here is don't ever get sick. Yeah. That's the key, everybody. That's right. So we're going to go from 1960s Liverpool over to the New Orleans area where they have hurricanes. Supposedly they have a hurricane party every time the wind blows have heard, but they actually do have legitimate hurricanes. And those hurricanes can do a lot of damage, as we saw in 2005 with Hurricane Katrina. By the time Hurricane Katrina rolled around, a woman named Melanie Martinez was on her fourth house having been destroyed by a hurricane. Yeah. Previously, George in 1998, betsy in 1965, had destroyed her house by the time Katrina came around. But after Katrina, everybody learned their lesson. They're like, okay, we've been taking this way too insuishly. We need to really actually protect New Orleans from flooding, from hurricanes. And so the federal government stepped in, the government of Louisiana stepped in, and they really fortified New Orleans. So that years later, seven years later, actually, to the day of Katrina making landfall, when Isaac made landfall, New Orleans held up. It was a pretty big hurricane, but it weathered New Orleans weathered it, unfortunately, in little tiny town of Bathwater, just a little south of New Orleans, which I thought south of New Orleans was like the Caribbean or the Gulf, I guess. There's a little town called Pathway. They did not fortify this town. And it just so happened that's where Melanie Martinez builds another house that proved to be her fifth one that was destroyed by a hurricane. Yeah. This is truly bad luck. Granted, all of those houses were in the same flood plain, but it's not like everybody's house was destroyed every time. This was truly bad luck to have five houses lost. And this last one before Isaac, she was selected for an A and E reality show. Hideous houses got a $20,000 makeover, brand new kitchen, new appliances, and a new sewing room. And apparently that episode aired just a few weeks before Isaac came around, destroyed that house, too. And when they asked her in 2012, why do you keep building here? It's like everyone else. She's like, this is my home. I want to live where I was born and raised, and this is my home. Yeah. Can you imagine what that phone call is like? It's like, hey, I'm a producer with hideous houses, and your house has been selected to be on hideous houses. She probably applied. Is that how it works? No, I think they just go scout your house and really, I'm sure you apply. I think it's very from show to show. So for that last time with Hurricane Isaac in 2012, she and her husband and their pets and Melanie Martinez's elderly mom barely escaped with their life. They had a hammer through their roof. They were trapped in the attic with the floodwaters rising. They had to hammer a hole into the roof and climb out where they were rescued. Yes. Man jeez. At least they got out. They did. But the thing that makes it really bad luck real quick, Chuck, is that Melanie Martinez said she would never have stayed around for that hurricane because of her elderly mother. She wouldn't have risked her health. They got stuck there because her van broke down. Well, but she got out. Okay. There you go. She couldn't save the house. Yeah, it's true. It's very sad. All right, so this next one is this is pretty remarkable. Whenever I hear about people that are and I've heard stories like this over the years, where people had the bad luck to be in various places where, like, terrorist attacks have happened, like, more than once. Right. And this British couple. Jason karen's Lawrence and his partner Jenny. This happened three times. They were in New York City on 911, right? On just a regular holiday there. So that's number one. A few years after that, they went vacationing in their very own London in July 2005. And just a day into that trip was when the suicide bombers attacked the London Underground, which was horrific. I don't think they're in the Underground at the time, but I imagine at this point, they're like, all right, what's going on here? A few years after that, in 2008, they were like, all right, we're going to get out of town again, and this time we're going to Mumbai, India. And another terrorist attack when the luxury hotel was attacked in the railway station and 174 people died there. They were all three of those. All three. The three biggest terrorist attacks, I guess, in the west, in the 21st century. They were there for yeah, the deadliest ones, at least. And they thankfully survived all three of those. But I imagine after those three trips, they're probably not going on vacation very much anymore. They built a pool in their backyard and they're like, this is what we're doing from now on. Man I can't imagine. I really can't either, tell you the truth. Should we take a break? Let's take a break, and we're going to come back and talk about some more hard luck cases after this, okay? Okay, Chuck. So this one I can't quite put my finger on, whether Alexander Graham Bell is a no good thief or not, I don't know, because I think I saw some more recent stuff, and I think that his image has been a little more reformed. We'll get to that. But if you're in Italy and you're a little kid and you are taught who invented the telephone, they do not teach you that it was Alexander Graham Bell. As a matter of fact. They may spit when they say the name Alexander Grand Bell because they very much believe that Alexander Graham Bell stole the idea for the telephone from Antonio Meochi. Who is an Italian inventor who seemed to have invented something very telephone. Like. At least a few years before Alexander Graham Bell supposedly invented his yeah. He actually filed a patent. Preliminary patent. That is. In the US. Five years before Bell, for what he called the Teleterophone, though, which is a much better name than telephone. Do you think so? I would love it if people were like, can I buy your Tele trifono? Let me see your trow bro. Yeah, see there? I love that. So, Antonio Miucci, he definitely realized that you could send sound over electrically activated copper wires back in, like, the 1830s. He knew this, and he started kind of messing around with it. At one time, he created, basically, a telephone between his workshop and his wife's bedroom because his wife had been stricken with some sort of paralysis. And to be able to communicate with her without having to go in and check on her all the time, he basically rigged up a telephone. This is in the, I think, the 1860s in New York, right? Yeah. And even debuted this invention to the press. But he didn't speak English, and the English speaking press in New York didn't speak Italian. So it was really just covered by the Italian press. But this guy in 1860, gave a demonstration of his telephone, and again, it wasn't until 1876 that Alexander Graham Bell got his patent. And like you said, Miyucci, he filed a preliminary patent. And I looked into this. You know what those are? Yeah. So the preliminary patent is basically this. You pay a much lower fee to basically put a hold on your invention. You say, this thing is coming. If anybody else starts sniffing around with their own invention, you let me know. And then the patent office will give you three months to file a formal patent, which is, again, more expensive. So the idea is that Mauchi didn't have enough money to file a full patent, so he placed a preliminary patent and didn't have enough money to renew it. You have to renew it annually, and Alexander Granbell swooped it. Yeah. And here's the thing. I thought, well, I mean, there have been plenty of inventions where people working in a vacuum came up with a similar idea with similar technology. Sure. But Miyogi actually shared a space with Bell that's when I was like, okay, it's not a good look for Bell for sure. Yeah. And. Then I did a little more research. I was like, did Alexander Graham Bell steal the telephone? And this is not news. And I saw an article that was like, yes, he stole it from Elisha Gray. And I was like, who. Well, he's the one who supposedly went to the patent office the same day, within hours of Bell to file a patent on the phone and lost out. Yeah. So there are several people that claim that Bell it was not his original idea. Well, Mauchi actually sued Bell. Oh, yeah. And the case made it all the way to the Supreme Court, but then Mauchi died before it was resolved, and they threw the case out. Very sad. But the House of Representatives in 2002 voted on a resolution to say, yes, Antonio Mayoche is the inventor of the telephone as far as we in the US. Are concerned. What I saw what I referred to earlier, that I was wondering if his image had been reformed. He had his extensive notes about his invention that he would have had to have falsified and that apparently had been scrutinized by historians. So if he was a fraud, he was a really methodical fraud, I guess. Well, that's one of the complaints with Elisha Gray, is that the sketches were, like, virtually identical to Greys. Oh, really? Yeah. Wow. I think we need to do at least the short stuff on Alexander Grand Bell. Yes. I think that could be a full EPI. Okay. Full EPI? Yeah, full EpiPen right in your thigh. All right. Like the time you got stung by that bee. You remember that? I know, it was harrowing. All right, so this one's actually kind of fun because I like it when the bad luck isn't super devastating to someone's life and that they kind of roll with it. You know what I'm saying? Yeah. Castus mitzotakis definitely rolls with it. Yeah. Nothing bad happened here. There's an annual lottery in Spain that dates back to 1812 called El Gordo. It's a Christmas lottery, and they call it El Gordo, the fat one, because it's a big, big fat payout, and it's very much a tradition in Spain. And in 2011, the jackpot was, at the time the biggest ever, close to a billion dollars. $950,000,000. And there's this little town called a sodetto, and people in this town is it Italian? No. Okay. I didn't say soDet, though. It was close. No, it was just a little flair. Okay. So in Sodeto, residents there would pool money together, sometimes buy their lottery tickets because it costs $26 a piece. It's not like going down and buying, like, the I don't even know how much Plato costs in America. Is it like a dollar? Yeah, exactly. Sure. We did a lot of episode back in the day, didn't we? I think we talked about El Gordo in the lotto episode because I recognized the name. Yeah. El Gordo. So the tickets were $26 at least in 2011. And this town pools their money together. 70 different families all chipped in because times are tough. And they didn't spring for their own ticket. And they won. They did win this town of, like, simple farmers whose backs were kind of up against the wall from the economic downturn you referenced. Apparently they were also experiencing a prolonged drought, too. Everybody's a little tense overnight. Had all of their money troubles just go away? Every single household in the town won a minimum of $130, $130,000. I'm sorry. Up to millions. Right. Like, if they bought full chunks of the tickets from this lotto. And so all these people rode their tractors into town on Christmas Day to celebrate that they had all just won the lottery. All except one guy, Costas Mitzotakis, whose house was not visited by the people selling the lottery tickets for the town fundraiser and who didn't buy a ticket as a result. Right. He lives a little bit on the outskirts of town with a woman, his romantic partner at the time, and she actually bought in and won 100,000 American dollars. Now I guess it was €100,000. Okay. So, yeah, it was about 130,000 American dollars. Yeah. So she won and he did not they're not together now. I don't know if that had anything to do with it. I'm not saying it does. I think they had already split up. Okay. But at any rate, he didn't win any money. But he's a filmmaker, and he was like his quote was it was really a gift from heaven, as if someone had given me the perfect script. So he decided to make a documentary about this town and about this lotto in and about these villagers who apparently did not change their ways much. They all still live very simply, and they all still shared lots of family in a single house. And it was really kind of heartwarming. And I read an article from just, like, a year and a half ago where he was supposedly finishing it up, but then I never saw anything about the actual documentary, so I don't know if it was ever released or finished fully. I also read that he made out okay. He'd been trying to sell his property there for a while, but because of the economic downturn, he couldn't get rid of it. And right after, somebody bought it from him. Well, that's good. Hopefully at full asking price. Yeah. And he seems like a good guy. He was kind of like, I didn't buy a ticket. Yeah. What are you going to do? Make a film about it? I guess s happens. That's right. So hat tip to costas mitzitakis too. That's right. So, Chuck, we're moving along. We're going from Spain to right here in Atlanta. Yeah. Do you remember the 96 Olympics? I do. Because I was on a road trip out west, my friend and I, that's when we took our two and a half month trip in a Volkswagen van, and we're like, we're getting out of Atlanta for the Olympics. You did not miss much. Yeah. I remember everybody in Atlanta who owned a business sunk tons of cash into their business to revamp it for Olympic fever. And no one left downtown. Nobody. They just stayed downtown. But one of the other things about the 96 Olympics, aside from one of the most mediocre, maybe actually just outright bad opening ceremony pretty bad. I just remember being on the road in a cheap hotel room in New Mexico and seeing stainless steel pickup trucks, and I was just like, oh, my God. What's going on? So bad. That's so Atlanta. It's hot. Lana right there. Yeah. Jeez. In addition to that, the 96 Olympics is also remembered as the Centennial Olympics is 100 years after the first modern Olympic games in 1896. But really, more than anything, it's remembered for the Olympic Park bombing, which is a huge deal. And it was memorable because it was a big deal like that. This was an act of domestic terrorism here in the United States, and it was at the Olympics, and it actually could have been way worse than it was. One poor woman from, I believe, Albany, or Leesburg, Georgia, died. I think a cameraman from Turkey died from a heart attack running to the scene, but, like, 100 people were injured. But right before that bomb went off, it was a 40 pound pipe bomb filled with screws and nails and all sorts of projectiles. There are a lot of people standing around at watching a concert by Jack Mac and the heart attack at, like, 01:00 A.m. In Olympic Park. And had they not been moved by a security guard named Richard Jewel, surely more people would have died. Yeah. So Jewel sees this backpack again. This is now a backpack on the ground. Like, everyone would be like, whoa, whoa, whoa. What's that thing doing there? See something, say something. See something, say something. Yes. 96. It was just a year after the Oklahoma City bombing. It wasn't like this was on everyone's mind at the time. And Jewel said, hey, I think we should get out of here. There's a backpack on the ground. Something smells fishy. And I don't think he meant there was literal fish in the backpack. Sorry. That was terrible. It's okay. And he got people out of there and alerted authorities, and they started clearing the area pretty heavily and very quickly. Richard Jules on the news is a local hero. National hero. Yeah, national hero. And everything was going great until all of a sudden, he was looked at as a person of interest, like, the next day. Yeah. Apparently the AJC got a scoop from the Atlanta PD that the Feds and everybody were starting to wonder if Richard Jewel wasn't the type of guy who would plan a bomb in order to put himself in a position of being a hero. Yeah. They were like, he fits the profile. I remember all that stuff going down. Yeah. And it's crazy how you can see somebody differently when people paint them a certain way. He just looked like he had that mustache. What's he hiding with that mustache? His eyes are a little beady, aren't they? He had been charged with impersonating officers, so he's clearly like a wannabe cop kind of thing. And he looked really bad. And then finally, in October, the FBI was like, Richard Jewel. No, we cleared him. He's not a person of interest. It was surely somebody else. But by this time, Richard Jewel's name had been drugged through the mud associated with a major act of terrorism at the Olympics in the United States for months before he was cleared. And the damage was very much done. Yeah. Of course, everyone knows the real bomber was Eric Rudolph. And again, those four months were really rough on Juul and his family. And even after he was cleared in October, it's like everyone knew he was cleared, but it's still one of those things where it's attached to his name. Yeah. He went from the suspect phase to the late night talk show monologue joke phase. Yeah. That's not a good transition. No, it isn't. Very sadly, he died in 2000, just the young age of 44 from complications of diabetes. Yeah, so he had it rough. He got, like, a settlement from CNN and New York Times for, I guess, overzealous and unfounded reporting. Maybe, but he did not have a great last part of his life. All right, the last one, folks. Breaking news. Josh emails me about 30 minutes before we record or so and said, by the way, the number one guy on the list is a fraud. I said, he may be a fraud. Oh, I thought you said he was a fraud. Oh, I'm trying to see away here. Okay, sorry. It's not proven that he's a fraud because let's just get into all this, okay? Yeah. What's his name? Selak Franny. Selak Frani everywhere else. I saw it. F-A-R-N-E-I don't know what to believe anymore. I know. We've just lost touch with reality. Charles So, he has been dubbed the luckiest man in the world for supposedly surviving seven brushes with death, ranging from a train going into an icy river to cars going off of cliffs again into icy rivers, cars catching on fire, cars plunging off of cliffs, like, so much stuff that you're like, can this be true? Especially the plane crash that went down where he supposedly was sucked out of a door and landed on a haystack. Yes. Before the plane crashed? No. Is this real? So here's the thing. All of this starts in, I believe, 2005. He buys a lottery ticket, wins, like, a million dollars or million euro lottery. And that happened. That definitely happened. Okay. And he was interviewed by the Scotsman, the newspaper, the Scotsman. And in this article, he's like, oh, you think it's lucky that I won a million dollars? Let me tell you about some of the unlucky things that have happened to me. And he starts reeling off these stories of, like, just narrowly escaping death, and The Scotsman's like, wow, that's fantastic. We're going to print this. And the Scotsman printed it. And all of a sudden it started getting picked up by other news outlets and other news outlets. And other news outlets. And then finally, in one of these articles, there was a commenter who identified himself as Franay Selak's son, who said, hey, not one single journalist has ever independently verified a single one of these stories. This guy is actually my father, and he has always wanted to be famous. So when he was interviewed for winning the lottery, he saw his chance and he made all of this up. Well, if it was an Internet commenter, it must be true. Exactly. That's why I was COA, because it's like is that the only place you found that? Yes, but the point remains correct. None of it has ever been independently verified. It's entirely possible that he wasn't on any plane or in a bus accident or that his car crashed. It's not verified that he has been. It hasn't been clearly shown that he hasn't been. It's just this guy makes a really good point, that this dude who everybody says is the luckiest man in the world. It's possible he made it all up. Now, how can we not get to the bottom of this? What do you mean? Well, I mean, we found out the world is flat and that they fake the moon landing through research. Why can't we find out what happened with Franaisella? Like, you and me specifically, or anybody? Like, surely you could find this out, right? Yeah, I guess you could. I think no one's gone to the trouble of doing it. It's a good story that everybody likes. It's not really hurting anything for him to be lying and for the lie to be perpetuated. It's more just kind of laziness among journalism, I guess, including us, because I didn't go get to the bottom of it. I didn't go independently verify any of his claims. Well, I did see an article that is that where you saw it at all? That's interesting.com. No, I didn't see it on there. I don't remember where I saw the article. Go ahead. Well, there was an article that talked about the fact that mentioned the commenter or whatever and the doubts. Yeah. I think that's become kind of a thing because there was a viral video that made the rounds that was really interesting because it's just this cute little animation of this guy's story in his life. And I guess I saw the thing about him being a possible hoax on BBC. Yeah. So if you put BBC together and all that's interesting, you have legitimate fact. Right? And I apologize for looking at my phone right now, but I'm doing a real time investigation, and apparently some people have Googled and these plane crashes and things aren't documented, so it sounds like it might be false claims. I don't know. Okay. But even still, it's a great story. I mean, just the fact that this guy made up all of this load of BS during an interview, it's pretty hilarious. He's one of the great improv comedians of all time, right? It's a good way to end things, too, don't you think? I think so. Well, thanks for joining us, everybody. Thanks for putting on your smoking jacket and your house slippers, putting on a nice berry white record and relaxing with us. I hope you feel relaxed now. Do you feel relaxed, Chuckers? I do. And Jerry does, obviously. Jesus, sleep. I know. Well, if you want to know more about the unluckiest people in the world, just go look at stuff on the Internet. May or may not be true. Who really cares, right? Yeah. And since I said that, it's time for a listener mail, I'm going to call this one sort of an older one that I forgot about. So, apologies to Jessica Breslin, because I told her I would read this a month ago. Oh, boy. Hey, guys. Love the recent episode on rape kits, but wanted to make a tiny correction about how the Golden State Killer was caught. Although there was a time that the Golden State Killer's DNA was part of the backlog, the DNA had actually been identified and linked to his crimes. Since the problem was they had no person to compare it to. This changed in 2018 when they compared it to DNA submitted to a familial DNA base. When a relative submitted their DNA to the familial DNA site, they were able to see that the DNA was related, and from there were able to narrow down their suspects to two likely family members. After narrowing it down to those two, they're able to identify their suspect, collect a sample of his DNA to compare it to the Golden State Killers. However, still good proof of why testing backlog kits is still so important. You never know what sort of technological breakthroughs will help law enforcement catch the perpetrators, even when you don't have a suspect. I love the podcast. I appreciate all the hard work and keeping entertaining and respectful, even when it's such sensitive subject matter. And that is Jessica Breslin. I guess I said I was going up there at the end, wasn't I? Yes, indeed. You did go up there, Chuck. It was kind of a nice little flourish. Well, thanks a lot, Jessica. We appreciate the email. And if you sorry for being a month late and reading it, that was all Chuck. And if you want to get in touch with us, like Jessica did, you can go to stuffishnelo.com, check out our social links, get in touch with us that way. Or you can send us a good old fashioned email to stuffpodcast@iheartradio.com. Stuff you should know now is the production of iHeartRadio's How stuff Works. For more podcasts, my heart radio, visit the iHeartRadio app, Apple podcasts, or wherever you listen to your favorite shows. Hey, it's summer, everybody, which means schools out, the sun's shining, the daylights longer. And best of all, there's plenty of time to get lost in a good, thrilling story. So whether you're road tripping or relaxing poolside, tune into the podcast series on Amazon Music. My favorite murder from exactly right media. My favorite murder has something for everyone. Hosted by Karen Kilgarif and Georgia Hardstark, this true crime comedy podcast will share stories that will have you want anymore before you know it. Listen to new episodes of my favorite Murder. One week early on Amazon music. Download the free Amazon Music app and listen today.", "author": "sysk", "guid": "ocm1iu1ray-9a58-421f-aef2-f596b1704291", "url": "https://chtbl.com/track/5899E/podtrac.com/pts/redirect.mp3/traffic.omny.fm/d/clips/e73c998e-6e60-432f-8610-ae210140c5b1/a91018a4-ea4f-4130-bf55-ae270180c327/8553d01b-d49d-416e-8922-ae28004ce38c/audio.mp3?utm_source=Podcast&in_playlist=44710ecc-10bb-48d1-93c7-ae270180c33e"}, "4": {"body": "Welcome to stuff you should know from housetopworkscom. Hey, and welcome to the podcast. I'm Josh Clarke. There's Charles W, Chuck Bryant and there's Jerry to my right. This is stuff you should know. Why are your eyes closed? You sound like sweaty balls. Alice Baldwin shweaty balls from starting out live. And that just wasted right over here. Now I'm on Mellow. You mello? Yeah. You IRI. Yes. I love that. The beginning of this article talks about Botox. I thought it was a pretty good intro. It was, though. It said, One day we're going to look back on injecting Botulinum Toxin A into your face and think, that's just crazy. I think it's crazy now. Oh, okay. Yeah, I see what you mean. It's nuts. Yeah. If you step back and look at it, for sure. Paralyzing your face muscles to look younger. Yeah. Especially if you've ever seen Dead Calm. Did you ever see that movie? Yeah. Out on the water with the boat? Yeah. Remember he said that's what happened to the other people on the boat is that they all got botulism and died? I don't remember that. Yeah, that was his whole set up. His excuse or his explanation for what happened was Botulism. But yeah, that's what I think of when I think Botulism is dead calm. And with Botox, he end up looking like a freak. Oh, don't be judgmental. Not being judgmental, but it was pretty judgmental. No, that's judgmental, I guess. But, yeah, I think that's my stance. If you want to do that, then more power to you. But I think people look weird when they look consistently surprised, so they don't use it just for that. They used to treat migraines, excessive sweatiness, I should get it. Also known as hyperhydrosis. Yeah. What Botox? Like in the armpit or the hands? Yeah, like directly in there. I guess this toxin goes in and deadens the nerve cells. Maybe. I can't remember. The point is, we're both agreed sure. Even in a roundabout way, that it is a very strange, bizarre, you might say, medical treatment to inject toxin into your face to look youthful. Yeah, I was judgy I take it all back. That's all right. People want to do what they want to do, that's fine. My personal feeling is that it doesn't have the desired effect to make you look like you think. You look proud of you. Thank you. So, Chuck botulism. Botulin. Botox, we should say, is pretty much nothing compared to some of the other stuff that we've used in the past and in some cases still continue to use, because this is all based on an article on how the works called Ten Bizarre Treatments Doctors Used to Think We're Legit. It turns out that some of the stuff actually still is legit. Yeah. And we should plug our friends over at Saw Bones. Yeah. Justin and his wife Doctor Sydney McIlroy. And Justin does my brother and my brother and me podcast with his brothers. They have a spin off? Not spin off. They have their own podcast with saw bones where they talk about antiquated medical that's all they talk about, right, is antiquated medical treatments. And they said they were inspired by our podcast to start that one. Yeah. But every time we send somebody over to listen to them, they don't come back. Yeah. Stop it. I guess we created a monster. But anyway, we are in turn inspired by them and just a big blow fest. We're blowing smoke up each other's butts. Tobacco smoke. I tried to see if that was literally where that term came from to blow smoke up your arse, but all it did was redirect to the fact that people used to do this for real. And I don't know if that's really where the term came from or not. I don't either. I can tell you where the treatment supposedly came from. Yeah. It came from a legend. It looks like a legend. I think at the time, they took it as a factual story that a man rescued his drowned wife from a river, I think in France, and didn't know what to do. And a soldier just happened to walk by and said, take this pipe and stick one end into a rectum and blow on the lid end until she comes, too. I don't think we even said yet what we're talking about, which is a tobacco enema. We're no sawbones tobacco enema is literally blowing tobacco smoke up the rectum of an individual for a health reason. Right. And in this case, the original reason was to revive a drowning victim, which is apparently what it was initially used for when it came into widespread use. And I guess it was in widespread use. And apparently it did work. In this initial legend, the wife came to on the fifth blow and went to a local bar and got a drink and then went home after being resuscitated from drowning and then having a pipe in her rectum with smoke blown up her butt. Yes. And there's speculation that if it did work, it was the intrusion of the pipe or later on the bellows that probably did it. But the thinking at the time was that nicotine was a stimulant and that this would directly stimulate the person back to life. That's right. You mentioned drowning victims. That was so commonly used as a method for helping drowning victims that this equipment was put alongside major waterways, very much like we would have a defibrillator today. They had these along, like the river Thames, and you had to know where they were. And in 1774, doctors William Hawes and Thomas Cogan in London formed the institution for affording immediate relief to persons apparently dead from drowning. And they later changed the name to the royal humane Society. That makes a lot better. And they promoted this method by paying people for guineas to anyone who could successfully revive a drowning victim, I'll bet in those kids along the waterways to go to use it, and the tobacco would be missing because local twelve year olds have gotten into it. That's a good point. And there was even a little rhyme at the British Medical Association in 1774 at a meeting, tobacco glister, because it was also called glister, G-L-Y-S-T-E-R. These kits tobacco glister breathe and bleed, keep warm and rub till you succeed and spare no pains for what you do. May 1 day be repaid to you. What is going on? You know, what goes around comes around. What's going on, England, where I guess if you're giving a tobacco enema to somebody and you know that little rhyme, you probably would stop, because you'd be like, I don't want this coming back to me. I just rather pass on to the next world. Well, Dr. Richard Mead was the first guy who pioneered this in mid 17 hundreds. And by 1811 it was Kaput, because they were like, no, this is not working and it's bad for you. Yeah. And you're blowing smoke up someone's butt. Right. What are you thinking? And then later on, doctors were used to prescribe cigarettes going through the other end. That's right. Which is all untrue, supposedly. Oh, really? Yeah. I guess that was the Edward Bernays thing. Oh, yeah. Intent. All right, next up we have a mercury. If you've ever heard or if you've ever seen the awesome exhibit the Terracotta soldiers. Do you ever see that? No. China's first emperor, King Chihuang, he was the one with the terrakatta soldiers. Yeah, he was the one that was buried in this basically underground city that was so vast and had all these terracotta soldiers guarding him. And his own specific to him, I was about to say rated much of it, but they've explored much of it. But not his actual tomb still, because it has a moat of liquid mercury around it. So he's still in situ because of the that's pretty neat. And he took the stuff to make himself immortal, which is ironic because it's super toxic and it killed him before he was 40. Yeah. But at the opposite effect it did. His death didn't apparently get out to the rest of the world because mercury was used in other kinds of medicines for a very long time, apparently. Up until the 40s, if you had syphilis, your doctor would give you some sort of ointment, sometimes an injection of mercury to treat syphilis. Yeah. And it may or may not have treated syphilis, but it would definitely make your teeth fall out and make you, what would, I guess, generously be called? Agitated. Yes. There's a host of horrible things that can happen to you for mercury exposure. Yeah. Like death. Cinnabar was what they used in China as their or mercury for 2000 years. And I find it crazy that I know it was the first emperor of China. It was a long time ago, but it just seems weird that, hey, take this thing to make you live forever when it's actually one of the most toxic things you can put in your body. Yes. They had it backwards. Supposedly. Jeremy Piven had mercury poisoning in 2008. Sushi. Right. He was eating sushi twice a day. I remember that. And then I heard that sushi. And then I think I remember hearing that that wasn't true, and it was maybe it was, like, made up to get out of a movie or something. I don't know. I still looking at it again. I definitely remember when that happened, though. Yeah. Pretty strange. Sure. I mean, I love Sushi. Like, anyone go back and listen to a sushi podcast, but I've never had mercury poisoning, so Chuck up next is one of my favorites. But I could find almost nothing more on this. I found that it did, in fact, exist. Yeah, me, too. And there's schematics and stuff on the Internet, but the Whirling chair, there's not much to it. No. Again, mid 19th century, when the mentally ill were treated very poorly, locked away, put in iron cages, they had one thing I found called a tranquilizing chair. And basically, it looks like an electric chair. You're just sitting up, completely strapped in, but you have a box over your head. Well, what's funny is that was one of the more humane techniques for treating mental illness that was, like, the result of the humanism progressive movement from the mid 19th century. That's crazy and sad. Oh, yeah. The history of the treatment of mental illness. Not just like yeah, we've talked about it a lot. It's just across the ages. It's really, really sad. Yes. Very misunderstood and still is in a lot of ways. But the Whirling chair was not a lobotomy. It was not an ice shower or a laxative or an insulin coma. Or an insulin coma. It was much better. It was a chair with a spring and lever system, basically, where it looks like they had it was hooked up to like a crank. Yeah, like a crank that you basically just spun these people around until they passed out. Yeah. And based on the schematics I saw, if you were the operator, you had to wear pantaloons. Yes, that's right. And apparently they would say it would cure your schizophrenia because it would shuffle the contents of your brain just the right way. Yeah. Like, imagine being strapped to a chair that was spun around, where you became so dizzy that you passed out. And on top of it, you have schizophrenia. Right. And then on top of that, they came out and you say, how are you feeling? Are you cured? I'm cured, yes. Can I please go home now? Yes. Seriously, they're like, hey, at least we're not burning you at the stake for being a witch. I wish there was more out there on that, too, though I think a lot of this stuff went the way the dodo so there's not much info on it. Yeah. I mean, there's nothing. It's just there was such a thing as the whirling chair. Here's how it worked. And the reason why they used it was to rearrange your brain if you had schizophrenia. That's right. So we'll keep going because this is a lot of fun. Yes, it is. But first we have to take a commercial break, and we will do that right now. And we're back. Chuck and Chuck, do you remember what did we record on yesterday when we were talking about antioxidant? So remember we talked about how oxygen goes through and steals electrons from other atoms and other molecules to stabilize itself, and that's the process of oxidation. If you take that process and multiply it by powers of millions, what you have is radiation poisoning. Exposure to high levels of radiation is what I'm trying to say. Yes, for the most part, we do everything we can to avoid this kind of thing. But it turns out that in the late 19th century, early 20th century, there were a lot of products on the shelf that did the opposite, that introduced radiation in the form of radium in the hopes that it would promote health and cure disease. Yes. Mary and Pierre Curie discovered it in 1898 and by the US. Was manufacturing synthetic radium to use in such things like radium chocolata from Birken Brown or radium bread from the Hippman block bakery. Radium bread? It's bread baked with radium water and popular until 1936. And radium water was a big thing. The reason why it was a big thing, apparently it kicked all of this off because there are natural spas in places like Hot Springs, Arkansas. And somebody started investigating the waters and found radon there. They said, well, radon that's radioactive. Where can we find that? They said, how about radium? So they started putting radium and everything. Yeah. Here's some of the other products. And you can look this up. They're a lot of fun. When you look at these old school ads for the navigator, it was a radium lace bucket, basically with a little spigot. It's like a little water tank of water. So it just introduced radiation to whatever water you put in. Yes. Or you could get what they call the radium coin that you could just drop it like an alkaline or into your water. Nice. There was the radium scope, which is a toy in 1942 that offered the luminescence. And the ad also said, it also doubles as a wonderful night light because it glows. No. Oh, yeah. Wow. It was for kids. Wow. Toothpaste from a man named Alfred Curie, who was no relation, really, even though he used that to his advantage, I'm sure the Curie name. And he also had the faux radio brand of cosmetics rejuvenates and brightens the skin this also kind of brings to focus why little kids chemistry sets frequently included radioactive materials, like in the middle of the 20th century. Does it glow? Well, no, because you could get it in water if you wanted to, or cosmetics or contraceptives or chocolate. So why wouldn't you put it in a kid's chemistry set, too? Sure. So before I didn't understand that. Now I understand. So supposedly the trend really started to die off in the 30s, though, thanks to something called RadiThor. And RadiThor was a little tincture that you would take these little couple of fluid ounce bottles that were highly radioactive. They had just tons of radium in them. And I guess one of the owners or one of the investors in the company, his name was Ebin Byers, he was a pro golfer, too, I believe he very publicly died of radiation poisoning because he drank three bottles of this stuff a day. Wow. So after that, the public was like, maybe we shouldn't be doing this anymore. Well, another thing they used it for, between 1917 and 1926, the US. Radium Corporation used luminous paint to paint clocks, clock faces, so you could see them. And workers were even taught to shape paint brushes with their mouths to maintain a finer point. So they were sticking the paintbrushes with the paint on them in their mouth, and they encouraged them to paint their nails, their teeth, and to ingest it. But management, suspiciously always stayed away and avoided exposure themselves. And I know there were a bunch of lawsuits because of that. And the other thing I found, too, was they used it before viagra and Cialis. They called them bougies. B-O-U-G-I-E-S. Radioactive wax rods inserted into the urethra. Isn't that crazy? Yeah, for a number of reasons. Yeah. Or they had, like, an athletic supporter containing a layer of radium impregnated fabric that you would wear if you had trouble getting an erection. It's not nearly as bad as the rods. No. All right. How about Euro therapy? Dude? So this one apparently is labeled quack medicine, but there's a lot of it makes sense intuitively. Yeah. So ural therapy, drinking or ingesting or having your own urine shot into your bloodstream. Yeah. Some people inject it. Yeah. It's still a thing. It is still a thing, yeah. Here's why. Urine is a byproduct of the blood. 95% of your urine is water, two and a half percent, minerals, stuff like that, salts, things like that. Apparently, if your blood is toxic, you have toxins in your blood, your body is triggered to clean it out, and your urine is clean. If your urine has toxins in it, your blood is cleaned out, too. There's like the symbiotic feedback loop, where if one is clean, the other one is clean. If one is toxic, the other one is toxic. And that you can trigger a blood cleaning, your blood cleaning drive, supposedly by drinking your own urine. By reintroducing the toxins over and over again, your blood could be conceivably cleaner. That's the thinking behind this. Again, intuitively, it makes sense. Yeah. Some people still think it can stimulate your immune system and actually fight cancer. Exactly. Basically by making your body, basically, your immune system react more vigorously. Right. It's like running it through the ringer on purpose. Yeah. The problem is there's no evidence behind it. Exactly. There have been individual reports of it stopping cancer growth, but no scientific evidence has come out in favor of it. But people still do it. Yeah. And there's also been tons of stories about people surviving for days and weeks by drinking their own urine after being trapped in, like, a collapsed hotel or something like that. Right. But yeah, there's still, I guess, pockets of people who engage in urine therapy. Yeah. And also, we should mention that it does not help your jellyfish sting. I did it. Don't be dumb on that. Really? It actually definitely makes your jellyfish thing worse. That's another one of the things, like, why do people say that if it makes it worse? I don't know. It was an episode of Friends, for God's sake. I know. They propagated the lie. Jerks. Who peed on who? I can't remember. I think didn't they all pee on Monica? Yeah, I think Monica got peed on, but I don't know if it was everybody. Maybe it was everybody. Of course they didn't show it. It probably wouldn't have been. I don't know. Yes, I think it was Courtney Cox. All right, this next one bit of a warning. It is sexual in nature, so if you're listening, maybe you should go ask your mom or dad if you should continue listening. If you're a child yeah. An honest kid or no, if you're an adult, tell if your elderly mother or father cannot listen to something about the female orgasm. Right. Which supposedly, apparently, especially in the Victorian age, but for centuries before that was widely considered not to exist. Yeah. But strangely, there was a medical procedure that women would undergo called a pelvic massage. Yes. To treat I don't think we even said hysteria. Right. Because women were hysterical, quote unquote. Right. They couldn't have orgasms, but they could have hysteria. Yeah. Which we should point out what the hysteria was is normal female sexuality. Okay. We know that now. Right. But back then, it was hysteria. So somehow, somewhere along the way and apparently, there's evidence that in ancient Greece, the pelvic massage was carried out. Yes. But in the Victorian age, you would go to your doctor, if you're a woman, and get a pelvic massage, and then you would be brought to what was called hysterical paroxysm, which is orgasm. Which didn't exist. That's right. It was hysteria. Or wandering womb was what it was also called. The wandering room was different. Oh, it was? Yeah. That was, like, the idea. And apparently, hippocrates either at least espoused it if he didn't come up with it. That was the idea that the womb or the uterus floated freely inside the woman, and if it moved around too far, it could cause all sorts of other problems. Got you. So it's different than hysteria, but the treatment was the same. Yes. Which was bringing a woman to climax. Right. A doctor hysterical paroxysm. Yes. And the doctor would do this initially using his hands. And I read one article from the New York Times about it and said, there is no evidence that the male physicians enjoyed this. On the contrary, this male elite sought every opportunity to substitute other devices or have the husband or midwife come in and take care of business for them. Got you. So it wasn't some pervy doctor. There's a lot of misunderstanding going on at the time. All over. They said by the end of the 19th century, 75% of women suffered from hysteria, which can also be read as 75% of American women were normal sexual human beings. And I guess the other 25% were just repressed and didn't know they should be or could be normal sexual human beings. Right. So it's just crazy. They call the hysteria and that it went up until the 19 and 20s. So you were saying that doctors were looking for any kind of substitute they could get their hands on. Well, apparently in the late 19th century, somebody introduced the vibrator. After that, it became a medical device originally when it was introduced. Right. Yeah. Because it brought that time to achieve the hysterical paroxysm down from anywhere up to an hour, down to about ten minutes, ideally. And you could buy them at Sears and Roebuck. It was, like you said, a medical device. And women love them. And by the 1920s, they started to peer in erotic films, and that's when people were like, oh, well, this is not something we should use. This is no longer a medical device. Yes. Which is interesting. It's all sort of backwards, isn't it? So this one to me, Chuck. The next one leeches. Yeah. We talked a little bit about medical leeches before because they are still around, which is kind of hard to believe if you've never heard that little tidbit. Yeah. This is why in the intro, I was saying, like, hey, some of this stuff still works. Right. And leeches are a sterling example of that. So for a very long time, barbers were originally called barber surgeons. Yeah. And they were called that because they would perform lots of surgery, which is why the barber pole is red and white. They would hang their bloody towels and they would flip around in the wind. And the barber pole is symbolic of that. Bloody towels whipped around in the wind outside of barbers. Yeah. Supposedly. That's the legend, as far as I know. I think it was true. I believe it. But one of the things that barbers would engage in was blood. Blooding, yeah. You remember the old shylisk with Steve Martin? Years ago, he was a barber. This is in the Think when he was a guest. And people come in for everything, and he's like, you just need a good bleeding. Like everything under the sun, people come in for let's just put a lancet in there and open up a vein and see what happens. Yeah. And that's basically what they did. It was more spiritual thing, like the evil spirits would be out through your blood. Or like we mentioned in the anesthesia episode, they would use that for anesthesia and do stupor through blood loss, but they wouldn't always use lancets. And apparently that was one of the reasons why George Washington may have died, was just too much blood lighting. Oh, really? His doctor really put his foot on the gas with bloodletting when he was on his deathbed. She go to Mount Vernon, didn't she? Go? Yeah, I've been a couple of times. There was like a whole they have, like, I think the bloodletting bowl that they used on them still there. Oh, I didn't even notice. There's a separate museum that's brand new. I went to all that stuff. Is that where it is? Yeah, but there's the bed that he died in right there. Yeah, you can go laying it floodlighting balls right there. Yes. You can't go lay in it. But rather than lancets, they would also sometimes use or very frequently used leeches. And they've been using them for thousands of years, apparently for bloodletting. Yeah. And this was back when they practiced what was known as humoral medicine based on the four humors in the body, which, as everyone knows, because of the popular T shirt we sell flim, yellow bile, black bile, and blood are the four humors. Right. What T shirt do we sell? I was just kidding. We should have one. Yeah, totally. The four humors. Just have that on there and then S y SK on the front. Okay. We can be a big seller. Yeah, sure. Who doesn't want a shirt that says black bile and flam? Yeah, flam. So with blood lighting or with using leeches for bloodletting? Everyone who I think it was the Indians originally from India who came up with this using leeches for bloodletting. And they were really onto something, because, like you said, medical leeches are still in use today here in the United States. They are an FDA approved medical device. That's right. And leeches secretes something called heroodin. That's what I'm going with. Houdin. H-I-R-U-D-I-N. Although the guy from Cell Bones would have said it. Right. And in their saliva, you will find harudin. And harudin is an anticoagulant? No, it's a coagulant. So it keeps you from bleeding to death. Right. It has antibiotic properties. It's a numbing agent and it's a vasodilator. Right? Yeah. Which means that it relaxes your blood. So it can flow more freely. That's right. But it also is an anticoagulant, so you don't bleed to death. A coagulant. All of this in leach saliva. Yeah. And they use it today for skin grafts and for when they reattach limbs, that kind of thing. Yeah. I think we had someone even write in and send us pictures of their medical leeches, which are in little vials. It's pretty cool. It's pretty neat. But I mean, this is ancient, ancient, millennia old medical technique that is still to this day used, and it's an FDA approved medical device now. Leeches are I just think that's really cool. It is super cool, because it means they're still an open mind in the medical community. Oh, yeah, it's way open. We'll try whatever. We are going to keep going. I say we do all ten for the first time ever. What about you? Yeah, let's do it. All right. We're going to keep going right after this. All right, Chuck, we're back. Yeah, man. We're taking it home with I'm taking some medicine, man. Some cocaine and opium. I bought it at the cornerstore. Yeah, and then you could buy your rig to inject it from the Sears catalog. Yeah. My cocaine kit. Yeah. And scene. Were we doing a scene? I was playing myself. Apparently, you could get morphine, cocaine, all this stuff, very easily and in tons of medical or medicine and elixirs that you would buy over the counter in the 19th century. Yeah. Not just medicines. Cocaine was in a lot of stuff, most notably Coca Cola at first, cocaine tooth drops, give your kids cocaine throat lozenges. You just reminded me. We did a gallery. There's a gallery on stuff you should know. Like, you have the cocaine poster, right? The kid yes. Cocaine tooth drop. Yeah. It's like crazy medical ads or pharmaceutical ads from yesteryear. We'll put that up when this is really good stuff. Yeah, but that one's in there, the cocaine tooth drops, and it's got like, a little kid playing happy because he's on cocaine. Yeah. Playing vigorously. And look at this kid. Did you see Mrs. Winslow's soothing syrup for teething children? I did. Look at how wasted that kid is. Yeah. He can't even pick his head up off the pillow. It's hilarious. His eyes are half lidded. He's like, I love teething. For the throat loss injures the ad says indispensable for singers, teachers, and orators to quiet a sore throat and to quiet the demons in your head. Yeah. Or to add the demons in your head. Or how about this cocaine wine? The coca wine market was really big. I've not heard of that. Yeah, the Vin Mariana was the most recognized and most popular brand at the time, but there were a lot of them, and that's just cocaine. We also talked about opium. There was something I saw another ad for something called stickney and pores paragoric. And McCormick made that the popular spice. Maker. And they even have the recommended doses for infants, children, and adults. And it was 46% alcohol, and the rest was opium. Wow. 92 proof, man. Oh, is that Ladanum or ladinium? Oh, Lordanom. Yeah. No, but that was like an opium alcohol mixer. Yeah, maybe. I guess it was laudingum. Is that how you say it? Loudnum? Yeah, I think so. Got you. It's not the same as delauded, right? Right. But deloitte is an opiate. But it's just a straight up opiate that's used for medicine. Yeah. I mean, it's crazy. People just used to put a few drops under their tongue and, like, it would start their child or I know we've talked about the Soderberg's TV show The Nick. The Nick? Is that on still? I don't know. I haven't kept up with it lately. But in the opening episodes, I mean, the doctor what's? His face is like shooting cocaine between his toes on a daily basis. I watched Ed Wood again the other day. First of all, it's even better than ever. It's great movie. Bill Murray is so great. Yeah. And then I forgot, Martin Landau is, like, a junkie in it. Yeah, he's an opium peanut. Yeah, but he injects it using his Sears and Roebuck opium injection kit. Oh, was it Sears and Robuck? No, but probably. Yeah. They used to sell lots of crazy things, so yeah. Strong drugs available over the counter until people wised up and started making strong drugs pharmaceutical style. Right. Yeah. They're like, you can't have this anymore unless you come to the hospital. Exactly. Then we'll hook you up. How about trepination? Man? Which you pointed out we talked about before in the Lobotomy episode. I think so. I know we've mentioned it at some point because we talked about the movie Pie. Yeah. Where spoiler alert. Oh, yeah. Big spoiler. That's how it ends. Yeah. Selfrepination it turns out that people have done that. There was a guy named Bart Hughes who was, I guess, kind of like a crazy genius from the we're. Just crazy. He decided that our brains originally were constructed for us to be walking on all fours. And once we started walking upright, the blood supply to our brain was diminished. Makes sense in a weird way. He also decided that our skulls had grown to decrease blood flow in the brain, and that the best way to counteract this was to cut a hole in your skull to allow more blood flow. Yeah, that's what trepination is, drilling a hole in your skull. Right. Or cutting a whole piece, a square, a circle, like removing a sizable chunk. There's evidence of trepidation that goes back thousands of years. Like 10,000 years. Yeah. And some of these skulls show almost half the skull removed. But what's crazy is, with trepidation, including Bart Hugh's own self, trepination, the patient frequently survived. And this is long before anesthesia we're talking again 10,000 years ago where people were basically held down and somebody in, say, Peru or Mesoamerica or India or Russia all over the place. This practice was carried out. They would grab an obsidian rock and start shaving away at the scalp and then basically chisel out a portion of the skull and remove it to allow the brain to well, either to allow evil spirits out. Yeah. Back then, that was more of the line of thought. Or it's possible that they were treating an injury and this would reduce brain swelling. I found a great article in Vice. They did an interview with Amanda Fielding, who, in the 19th 70s, treepand herself. She was a follower of Bart Hughes. All bet she was. I think she's the director of the Beckley Foundation who does research into consciousness man. And she actually made a little film of her doing it that you can watch. It looks like super eight, and it's like super choppy. It's not very intensive, but two and a half stars. But two and a half stars, two tomatoes. But it does show her drilling herself in the head. She said she was very cautious and prepared very carefully, but she used an electric drill with a flat bottom and a foot pedal, tested the drill on the membranes of my hand to see if it would damage the skin, and then did it and made a film about it. And then afterward, I wrapped my head in the scarf, ate a steak to replace iron from lost blood, and went to a party. And she points out that she's not advocating self trepination at all. Yeah, but she said it benefited her. She said there was a feeling of the tide coming in slowly and gently, very subtly. One thing she really noticed was a change in her dream patterns. Her dreams became much less anxious. But she also says that it could be a placebo as well. She acknowledges all that, but it was interesting. I mean, this was the I think she was a follower of that guy because she said that the loss of pulse pressure in the brain when your Fontanelle's closed, basically, is the reason that she did it. Like, she fully believed that that's Bart Hughes all over the place. Yeah, totally. So don't do it, people. Now, do we need to say that? I don't think so. I hope not. All right, we got one more. You thought it couldn't get any weirder. Corpse medicine, aka cannibalism. Yeah, that's another way to put it. We did not cover in cannibalism weirdly, did we? I'd be surprised. I think we did pretty comprehensive if we didn't. You don't remember doing it, of course. That doesn't mean anything. So corpse medicine or cannibalism is basically eating human flesh to cure disease. And apparently it started out with the Egyptians, who decided that if you ate mummies yeah. Or mummy powder at least yeah. It could cure a lot of different diseases. Yeah. Like muscle aches and headaches. They also would rub human fat topically on your body if they thought something was wrong. Drinking the blood of a gladiator in ancient Rome was supposedly enough to cure your epilepsy. Yeah. How about that? Yeah, drinking blood is a big one, just throughout the ages. And speaking of mummies, also, it wasn't just food. There's this awesome Cult of Weird article about mummy brown, where up until the 19th century, I think maybe even the 20th century, mummies were used to make a specific type of brown pigment used in paints called Mummya. Interesting. Yeah. And then the artists started to figure out where it was actually coming from, and they stopped using it. But mummia brown came from mummies. Is that still a color? I think, yeah. So you can get, like, bare premium plus mummy and brown. Right. I don't think it's made with mummies anymore, but yeah, I've seen it before. I've seen it before. I read the article. It's out there somewhere. Yeah. What else would they eat? Fat bones. Yeah, fat bones. Grind it up and eat it, and you'll be cured. There's a pretty cool Smithsonian article called The Gruesome History of Eating Corpses of Medicine. If this kind of thing rings your bell, if you just got to know more. Yeah. You got anything else? You're ready for a nap? Yeah. This one? Yeah. If you want to know more about bizarre stuff, type the word bizarre in the search bar@housetopworks.com, and it will bring up this and who knows what else. Yeah, we got a lot of bizarre things in there. Yeah. And both of us just said bizarre. So now it's magic. Listener mail time. Hey, before I read listener mail, I want to ask a favor. Songs for Kids is a great foundation run out of here in Atlanta. What they do is they put musicians in children's hospitals and camps for kids with special needs and basically play music for them. That's awesome. It's that simple. And it's really neat. And you can start a fundraising page through your band. Right. So I thought, let me try and raise $2,000. Whoa. That's lofty goal. I thought it was pretty small. Oh, yeah, that's what it is. So my old man band, El Cheapo, we started a page, and you can donate as little as $10, and that would really mean a lot to me and those kids. So just go to songsforkidsfoundation. Orglchapoel. C-H-E-A-P. That's the band. Do you have a song in particular you want to play? No. You'll play any of the 500 songs? I'll play? Any of them? That's a great attitude. Yeah. Just go to songsforkidsfoundation. Orglchapo. Like I said, donate $10 or more if you want and help El Cheapo reach their goal of $2,000. And I really appreciate it, folks. Nice. All right, so listen or mail, I'm going to call this the or the Greetings from Manhattan guy who just finished catching up on a few weeks of podcast, I was excited to hear you mention the pronunciation of the in the folklore episode. I studied vocal music throughout my youth and in college, and one of the more important rules for my teachers that stuck out with me was about the word d. Word and word combinations can sound surprisingly different when they're sung versus spoken, so there are a bunch of interesting tricks used to counteract this. Dip thongs are used to emphasize two adjacent vowels, so a listener can hear both while glottal stops. Create a discrete stop between words so they sound distinct rather than like a big old mess of sounds with the word. The trick is to slightly adjust how it's pronounced. D should be used when it proceeds at word beginning with a consonant. Sorry. And the should be used when it precedes. A vowel may sound silly in bourgeois, but there is a reason for this. Like Josh Guest, a phrase like the apple sounds normal when it's spoken, but when you're singing and your words are strung together, it starts to sound a lot more like the apple. Makes sense, which is weird and a made up word. But switch to the apple and suddenly you've got yourself two fine words that sound recognizable even when sung. Next time you're listening to any vocal music, keep an ear out for this. I bet you'll start to notice this use everywhere. Big shout out to my former vocal teacher. So you would say the alfart. That's right. Not Valfart. So she thanks her for making her such a nut about pronunciation. And that is from Nicole. Thanks a lot, Nicole. Very nice. We appreciate that. More knowledge. We just keep packing it in. If you want to impart some more knowledge, if you want to inject it like some sort of urine therapy into our vein or botulism in our face, yeah, you can tweet to us via SYSK podcast. You can join us on Facebook. Comstuffysheanow. You can send us an email to stuffpodcast@housetofworks.com. And as always, join us at our home on the web stuffyshow.com. For more on this and thousands of other topics, visit housetofworks.com.", "author": "sysk", "guid": "od440qjzoc-e125-4557-9735-6fd89b3e2c85", "url": "https://chtbl.com/track/5899E/podtrac.com/pts/redirect.mp3/traffic.omny.fm/d/clips/e73c998e-6e60-432f-8610-ae210140c5b1/a91018a4-ea4f-4130-bf55-ae270180c327/43e15e65-aabb-4277-94df-ae28008fd926/audio.mp3?utm_source=Podcast&in_playlist=44710ecc-10bb-48d1-93c7-ae270180c33e"}, "5": {"body": "Ah, summer school's out. The sun is shining. The daylight is longer. So whether you're road tripping or relaxing poolside, tune into the podcast series on Amazon Music that's so good, it's Criminal Morbid. Part true crime and part comedy, morbid takes you on a journey from murderous mysteries to major laughs, all in the same week. Hosted by autopsy technician Elena Ercart and hairstylist Ash Kelly, this chart topping series will have you hooked before you know it. Listen to new episodes of Morbid one week early, only on Amazon Music. Download the free Amazon Music app and listen today. What if you were a global energy company with customers in different places on different systems? So you call an IBM and Red Hat to create an open hybrid cloud platform. Now, data is available anywhere, securely. Let's create a hybrid cloud that can change an industry. Brought to you by the Reinvented 2012 Camry. It's ready. Are you welcome to stuff you should know from housetopworkscom. Hi, and welcome to the podcast. I'm Josh Clark. There's charles W. Chuck Bryant. That makes the stuff you should know. Jerry's in the other room. Yes. Being quiet as commanded. Yeah. How are you doing? I'm great. I feel like I haven't mentioned Jerry once in a while. She's got a character playing she's a character on our TV pilot. There's an actress playing her. Right. Although you thought to have that removed. Right. All over the place. I was like, we need less Jerry, less Gerry. Not true. That's not true. So revenge. I'm a big revenge guy. Oh, you are, huh? Well, no, that sounds bad. I'm a big comeupant sky and justice guy. Sideline root. When people get their come up and justice is served, it's a very satisfying experience for me. Well, friend, you would have done well to have lived in Babylon around the BC. Oh, yeah. With the gardens. I love that stuff. Yeah, they were hanging gardens. I would have been all over it. Yeah, gardens figured heavily, prominently in Babylon. Sure. Especially Chuck. I think you would have enjoyed living under King Hamu. Rabbi. Yeah, the code. He's the guy who came up with a code. We take it. That whole eye for an eye thing, that you would stand on the sidelines, like, take out his eye. Take out his eye. He took the other guy's eye. I'm not like that. Because people are going to think I'm some violent person. No, it can come in many forms. I know exactly what you're talking about. Like Shawshank or Brooks Hung himself. No, come up. It's against the warden. That's satisfying to me, to see that in a movie. I don't remember what happened to the warden. Refresh my memory. Well, he ended up boy, should I not spoil it? I think it's fine. He ended up shooting himself as the cops descended upon him. What did he do wrong? What did he do wrong? He held Andy there for years, knowing he was innocent. He had the guy shot and killed, who Andy had tutored to get his GED, who had information that would get his release from, like when NEA melrose Place or something like that. Allie McDowell. Yeah, I think it was Allie McDonald. And then he squandered money from what do you call it? Pension. Yeah, not squandered. He bet. No, stole money, essentially embezzled money from the prison coffers it wasn't the warden play by Burl Ives or something. I remember him as like a grandfather type, very supporting, nurturing fellow. No, he was played by that guy that can't ever play anything again because of that movie. Weird. I have a list of revenge movies we can go over later. Okay. Yeah, there's plenty of those. Remember, there's a whole exploitation subgenre, like I spit on Your grave. That's on the list. But anyway, back to the Code of Hamurabi we take for granted these days, chuck the I for an eye. But this is literally the beginning of that and the beginning of systemic, uniform, socially sanctioned revenge. Sure. That's the justice system. It's revenge. It's like you did something and we're going to get you back for that. You're going to be punished. It's revenge. Yeah. That's the whole basis of the justice system. People can hem and haw about reform and stuff like that, but come on, it's revenge. It's punishment, it's reason. I'm not saying it should or shouldn't be like that. I'm just saying right. You can dress it up all you want, you can do whatever you can to, but when you boil it down, I think is what we're both saying. The whole basis of the justice system is revenge. And the Code of Hammurabi is the beginning of this, and it's also the beginning of the eye for an eye thing. If I may, there's a couple like, the Code of Hammurabi kind of deals with stuff that people were dealing with at the time. Sure. And it goes far beyond, like if you kill somebody you're killed, it gets kind of specific. One of my favorites is if a fire break out in the house and someone who comes to put it out cast his eye upon the property of the owner of the house and take the property of the master of the house, he shall be thrown into that self same fire. So a looter, essentially, you get thrown into the fire you came to help put out and then basically shirk your moral obligation by stealing instead of helping fight the fire. That's my favorite. Also, there's a lot about runaway slaves harboring runaway slaves, stealing slaves. If you find a couple of slaves and you want to bring them back to the owner, the owner owes you two shekels of silver. It deals with inheritance law. If a son who inherits his father's land is still too young and can't take possession of his field, a third of the field will go to the mother who basically is paid to raise them. Although I think she's going to do that anyway. Sure, but it's a uniform code, especially dealing with revenge, right? Yes. I say all this to tell you that revenge is very old, Chuck. It is. And that's the code, I bet took revenge over the caveman who wronged him in very primitive ways, I'm sure there was always revenge. And depending on how evolved tuktuk's brain was, if he had a dorsalum striatum, why didn't I get that the first time? If he had a dorsal striatum, which governs feelings of enjoyment and satisfaction, he would have probably liked carrying out that vengeance. Because our pleasure center goes off when we carry out acts of revenge, especially when we think of it. But that's why sometimes we'll go to such great lengths to carry out vengeance, because it feels good. So I'm not a vengeance carry outer, because I don't really get wronged. Like, I've never had any huge wrongings against me. I would knock on wood at this point if I were you, just but I like seeing it played out mainly in movies. Do you like standing on the sidelines and shouting for the person's eye to be taken out? Yeah, that's me. Do you want to talk about some cases of revenge? Because it's one thing to just say, hey, that's great, that guy got his come up with. But there's some really legendary and some very grim cases of revenge in the history of humanity. And we have covered well, you covered ten in your article. Yeah, we're going to cover, what, seven, eight, six, something like that. We haven't done a top ten in a while. It's been a very long while. Actually. We've never done a top ten because we only cover six or seven. But we haven't base one on the top ten as well. Correct. I like the Spam King one. Should we start there? Might as well. He's number ten. Alan Rosky was known as the Spam King because he was an entrepreneur in Michigan who was one of the guys, the main dudes signing you up for all those spam emails that we all love. Before the.com bubble even burst, verizon had him in court for bulk email spamming. But, dude, he's got a rap sheet a mile long. I looked at this is before the spam thing in the 90s, he had all sorts of insurance felonies, real estate. Yes. He's just kind of a hustler kind of dude. Very much. It's a good way to put it. But he got his comeuppance in the way of a junk email of his own when his address was leaked online and then really leaked online. Well, the whole way it came out was there was, I think, the Detroit Free Press, maybe one of the local papers did a spotlight, like just kind of a soft touch spotlight on a spacious 8000 square foot home yeah. That you paid $700 for. Because it was Detroit. Sorry. This one was on you, man. I was just going to leave destroyed alone, but go ahead. Yeah. So this guy is showing off this man who's been referred to as, quote vermin and quote scum yeah. Is showing off his 8000 sq ft. House built on bulk email and spam. I bet he regrets that. And somehow I couldn't go back and find out. His address leaked in the article. It basically gave away his physical address. Right. And that was it. The trolls got him. The trolls got him and signed him up for basically everything under the sun. As far as junk mail, like physical junk mail goes, which we've done. Wow. We did podcasts in junk mail. Remember that? We did remember where to get rid of it. And that one guy was like, no, we're employed by junk mail. So the peak of his junk mail receiver ship, he was getting hundreds of pounds and he was everyday. Yeah, he was pretty upset. I mean, I saw interviews with him today where he was like, I'm being harassed. And he was trying to get quotes to do something and they were just like, no, come up. I wish we had a trombone. Yeah, we should spice it up a little. Jerry, a trombone, please. Thank you, Jerry. All right. Did we cover him? Well, he's in jail now. Yeah, he's inmate 19593. Wow. You did your research. Because that was not in the article. We could send him a letter to Morgantown Federal Correctional Institution. Yeah, he was jump. Was it insider trading or he created a pump and dub scheme. Some sort of penny stock manipulation scheme is what I wrote. Yes. And he's still in jail? Well, it was 2009. He got a 51 month sentence. Yeah. But you know, sometimes that doesn't mean much. Like time served. You're free. He's still there though. He definitely made some cash doing bulk email. It was clever at the time. It was just annoying. Yeah, sure. But hey, we all got Viagra out of it, so we did. I didn't get mine. 47 Ronin. Okay. Yeah. So my nephew's middle name is Ronan, and I'm still not convinced that my sister and her husband know what Ronan is. I have a friend who named his kid Ronan. Does he know what Ronan is? I'll have to ask him. He's a fan of the show. Well, what's his name? I don't think he spells it this way, though. I think he spells it with an A. What's his name? Braxton. Braxton. Do you know what Eronin is? Answer us when we text him. Yeah, I don't think he spells it the same way. Well, let's tell everybody Ronan is a masterless Samurai. Yes. At this point, I feel like possibly if you really want to do some digging, press pause on this one, or just mark down your time code, go back and listen to our How Samurai Work podcast. That was a great one. Excellent episode. Yeah. And it will help you along with the rest of this. But if you don't feel like doing that, go back and listen to it anyway later on. But we'll give you the crib sheet. Basically, a samurai is pledged to the death to a single master, a Damio. Right. And that involves the samurai protecting the Damo with his life. That involves the samurai carrying out vengeance if the Damo is wronged or murdered or anything like that. And this is a lifetime contract. This is a lifetime affiliation. Remember, they're the opposite ninja, which is also a really good episode, too. They were just the hired guns, right? Yes. If I remember correctly, the Ninja were samurai were very loyal. Yes. Military advisors. Just cool guys. They had huge hammer pants, too. In this particular case of the 47 Ronin, during the Ado period, which is the early beginning of the 18th century in Japan, a man named Asano Naganori had some Ronin assigned to him, or that he had taken on 47 of them. And Naganori was headed to Kyoto to hang out, which was the capital at the time. And he saw a man he didn't like. And still to this day, no one's quite sure. I was going to ask you that. No one knows. Okay. No one has any idea what the problem is. But these guys have beef, basically, as Biggie Smalls would have put it, they threw down, did well. Yeah. Naganori pulled the sword out and slashed at the man. Didn't cause any harm or whatever. But this is Kyoto, the seat of power in Japan, and he's just taking a swipe at some guy in front of everybody important. And in Japan, this is a really big deal. Well, yeah. So much so that they decided that he should commit supuku, which we have covered before as well. Was that a separate one? No. What was that in? Was that in Samurai? Yeah, I think we really went into graphic details. Yes. We talked about the steps of supuku because it's very specific. Right. So, again, go listen to that episode. And he did commit supuku. Here's what I don't quite get. Why didn't the guy, Yoshi Naka, who he attacked, why didn't his Ronan come after? Well, he was dead. Why didn't his Ronin come after? He wasn't dead. No. Naganori is now dead. Right. So why did his people feel the need to take revenge when he's the one that started it? That is an excellent question. And that's what led to the deaths of the 47 Ronin. Okay, so let's talk about the story, and then we'll go into that. Right. Okay. These Ronan basically hung out and waited two full years. But you know what they say. What? Revenge is a meal that serves cold. Very nice. One of my favorite things. Is it really one of my favorites? Oh, yeah. I just think it's witty. And you think a lot about revenge, don't you? No, I just like that saying. It's a good one. You know, it's true. I'm with you. Like, two years later, they don't know what's coming. Yeah. And those Japanese winters get pretty cold. So two winters had passed by the time the 47 ronin decided to go pay a visit to the other guy. And they went and Yoshinakea was the other guy. They went to his house, staged an attack on his compound, found him in an outhouse, and said, hey, we will give you the chance to commit supuku here's. The same dagger that our master killed himself with. Right. They sat there and stared at him, and they gave him a beat and then said, okay. And they cut his head off, and they took his head in a bucket and took it to their master's grave. Yeah. Well, they cleaned it up. Do they? Yeah. Apparently they washed it for some reason, I guess. Well, they're very tidy. Sure. They're very tidy people, the Japanese are. And they took it to their masters grave and showed him the head and said, Here you go. And then they took it to the bakufu, the ruling council, and said, we're turning ourselves in. And the bakufu is the honorable thing. Yes. Maybe there's a lot of discrepancy about what was the right thing to do or what wasn't even at the time and still today. Right. But the bakufu said, okay, go kill yourselves. You have to wear down to 46 here. One supposedly was killed in the attack, whatever. But 46 Ronan committed suicide themselves. A lot of people died because this guy slashed at the other guy. Now, there's many schools of thought in this act of revenge. The ronin should have immediately gone to Yoshinakea's house and killed them. That may have gotten them out of the sentence to commit supuku. Another school? What is that? No waited. Yeah. If they had been like, oh, well, let's carry out this vengeance right now. Got you. Another school. Thought is that they shouldn't have done anything, that the bakufu had made a decision that their master had to kill himself and they had to abide by it. Sure. The samurai didn't see it that way. Well, that was their code, though it's not exactly the law of the land. No, it's true. And I think that connection between master and samurai supersedes anything that Vancouver came up with. But the last one, the hardest one for me to swallow, but it's possibly correct, is that the 47 ronin or the 46 should have, after they took Yoshinaka's head, committed supuku themselves right there. And that is a grave act of cowardice to turn themselves in because it showed that they possibly hoped for a slap on the wrist. Interesting. Or at the very least, the cutting off of their wrists. Wow. Style is what that is. You point out the 47th? Ronan Terasaka. Kichiman. There are reports that he was young and pardoned because of his age and that he lived to be 87 or he died in the attack. And I think there was more than 47, but there were 47 that assembled two years later and carried out revenge. Right. I believe. And there have been countless stories and movies and stuff about the 47. Ronan yeah. Including the movie the 47. Ronin there you go. All right. Big revenge, man. That was a roller coaster ride. Should we cover the Huguenots the massacre? That one's pretty grim. I will go over it real quick. I like the last line of it. Did you? I went back and reread it. I was like, that was it. Yeah, we'll nugget it there at the end. We'll save it. What if you were a major transit system with billions of passengers taking millions of trips every year? You aren't about to let any cyber attacks slow you down. So you partner with IBM to build a security architecture to keep your data network and applications protected. Now you can tackle threats so they don't bring you to a grinding halt, and everyone's going places, including you. Let's create cybersecurity that keeps your business on track. IBM, let's create learn more@ibm.com. Hey, everyone. When you're running a small business, every second counts, and you can't afford to waste a single moment. So why are you still taking time out of your day to go to the post office? And you could be using Stamps.com. Yeah. For more than 20 years, stamps.com has been indispensable for over 1 million businesses, because Stamps.com gives you access to all the post office and Ups shipping services you need right. From your computer. That's right. You can streamline your shipping process with Stamps.com easy to use software. All you need is your regular computer and printer. No special supplies or equipment necessary. And you can get discounts you can't find anywhere else, like up to 30% off USPS. Rates and 86% off ups. So stop wasting time and start saving money. When you use Stamps.com to mail and ship, sign up with promo code stuff for a special offer that includes a four week trial, plus free postage and a digital scale. No long term commitments or contracts. Just go to stamps.com. Click the microphone at the top of the home page, and enter code stuff. During the Protestant Reformation, there was a lot of stuff going on in France, mainly. A lot to be lost. As in 50% of the real estate in France allegedly was owned by the clergy. Oh. Catholic church. So they had a lot at stake. When the Protestants came to Colin, they were like, I don't know about you guys, maybe we should kill you. Yeah. There was a big problem. There was a big rift between the Catholics and the Protestants, and it was largely over land power. Sure. Because if it's all controlled by the Catholics, it's hunky door for the Catholics. But then now, if you have to divide everything in half. It's kind of a problem. So by 1572 in August in Paris, it was a hot one, and there is a huge wedding between a French Protestant aristocrat right now, a French Huguenot aristocrat, and a Frenchman. Yeah. Okay. Yeah. And this was not a marriage that was endorsed by the Papacy at all. No. It was already really controversial. It was a huge, huge affair on the social calendar. And so Paris was swarming with both Hugonauts and Catholics that were there at this wedding, possibly the most awkward wedding of all time. Like sworn enemies in the same church, right. Yeah. The marriage goes off without a hitch, as far as I know. And almost immediately after, Charles IX, who is the King of France, a devout Catholic, said, why don't we just take this opportunity to kill the military leader of the Hygieneauts since he's here in town? Yeah. And they did, and let's not stop there. Let's just keep killing people. And over the course of a week or so, I saw all kinds of numbers. Sure. Well, they didn't keep very good records in the but legend has it that the rivers in Paris were so full of dead bodies that they could not eat fish for months because of disease of dead bodies. Thousands, tens of thousands of French Protestants murdered, tens of women and children do 100,000. It started with the one guy then, that moved throughout Paris. Any Hugonaut found was killed, and then it spilled over into the countryside where basically the French king, Charles the 9th, carried out genocide against the Hugonauts in France. So that was a big deal. Yeah, sure. All right, moving on. We're skipping over, I want to say Dave Carroll, as per Chuck's request. Yes, but you can read that in the article. We're skipping Aaron Burr because you can hear about him, or you may have just heard about him in our dueling podcast. Yeah, good one. And let's go to Dr. Holly crippen. Oh, we're doing him? You want to skip him? No, that's fine. You take him, though. Okay. I thought we agreed not to do him. Okay. Dr. Holly Harvey Crippen was a homeopathic doctor in London, had a concert singer, wife named Cora. He's a pipsqueak. Did you see his no. Is he tiny? He's a pipsqueak. He was mad because he's small, and apparently he didn't like his wife's voice because he took up with another lady. She found out about it and said, you know what, jerk? I'm out of here. I'm the one that has the money, taking it with me. And after that, she went missing, of course. He says, hey, I'm going to take my mistress. I'm going to move to well, I'm sorry. He sold her jewelry first. He told everybody that she was on a concert tour in Los Angeles and died there and was very easy to figure out. Goodbye, Cora. So he set sail for the US. With his new mistress. I don't know if they were married. Probably know his new wife and the friends of the wife started saying friends, of course, started saying, Wait a minute, this is pretty shady. Somebody should look into this dude because we think he has blood on his hands. He was arrested when the body turned up in his cellar and hanged. However, in 2007, many years later, because it was 1910, they found forensic evidence that found out that not only was that not his wife's body in the basement who he was convicted of and hanging for. Yeah, but based on the evidence, perhaps a man, not even a woman at all. So they think possibly Crippen may have murdered this other person and gotten caught for that because his wife went missing and they think they murdered her as well and just disposed of her body. He did, yeah. He supposedly acted alone or he didn't kill this man, but he did kill his wife and ended up getting hanged anyway as an act of vengeance beyond the grave. Right. For killing his wife. Or he didn't kill anybody and was hanging wrongly. Right. Just vengeance twisted all up. What is wrong with you? Okay, let's do Lorena Bobbitt. This is a good one, because this is in our immediate memory. The crazy, 90s, grunge, flannel and dismembered penises flying out a car window. That's exactly what happened. John Wayne Bobbitt was not a model husband. No. And I really want to stress this, because I was like, well, when I was thinking of this, lorena Bobbitt was the first one that came to mind. Sure. And then I did a little more research. I was like, Good God. She had a really rough life. She was allegedly the victim of a lot of spousal abuse, physical abuse, mental abuse. She was an immigrant, and her husband supposedly used that against her to manipulate her, to keep control of her. She didn't speak great English at the time. And there was allegedly a lot of marital rape in that marriage as well, including the night of well, I don't know when it was, but it was 1993, when supposedly Mrs. Bobbitt said that her husband, John Wayne Bobbitt, came home drunk, assaulted her, and then raped her and then passed out. Apparently, this was one in a long string of these encounters, and she had had enough. So she got a knife, and while he was asleep, Chuck cut off more than half of his penis. A significant portion. More than half. And although, if you ask me, 5% would be a significant portion. 5%? That's like a Ziper accident. Yeah, but nothing needs to be going on down there. No, I agree. I'm saying in general. I mean, I'm not saying he did or didn't deserve it. I'm not weighing in on that. No, I see your point. He was a big jerk. I'm not saying people should do this. Of course. No, I feel like we should stay out of this little pool right here. Yes. Because if you do do the research and you do start to kind of see where she was coming from, she was the butt of many a late night joke for years. She just became a punchline. But if you look into her story, it was horrific. Yeah, it's very sad. Anyway, about 03:00 A.m., she takes this dismembered member and drives out into the night with it, at some point rolls down a window in the passenger side and just throws it out into the grass. And by some incredible luck, a sheriff's deputy managed to find it looking exactly like there was a missing child or something like that. There was a multi tens of thousands of dollars search party out looking for a dismembered penis in the grass, and they found it. That's the craziest part to me. Right. It's pretty crazy. And they reattached it, put it on ice, reattached it. She says she didn't remember it. She said she was later on, she said she was driving with the member in one hand and a knife in the other, and she said she went to turn the wheel and realized she needed a free hand and that's why she tossed it. Yeah. She went to court. She went to trial, and I can't remember what her charge was. It was one of those very clever old time 18th century charges. You shall be charged with penis cutting. I think that was the charge. Okay. She was found not guilty for reasons of temporary insanity. She snapped after years of abuse, and they said, you're fine. He was acquitted for assault charges on her, but he went on to be convicted later on for more domestic abuse on another wife in 2003. So they divorced in 1995. Here's the crazy thing. In 1994, he was in a pornographic film called Uncut. Yeah. He was in more than one. Oh, was he? I just knew about the ones. Yes, he was in one called Franken Penis. Okay. I thought Uncut was the one. I thought Franken Penis was the name of Frank and something I thought I remember that well. There's one called Uncut that came out in 1994, and Vince Neil and LEMAG are in it, plays a bum, and Vince Neil plays himself. Yeah. He was also in a band called the Severed Parts. No. Yeah. So he was clearly trying to make some money off of this incident, which goes on to show even more about his character. Right. Lorena Bobbitt went in a different direction and founded a women's abuse nonprofit called Lorraine's Red Wagon, which is an aid organization. And she has a little girl. Now, I don't know if she's remarried, but I believe she is with the father and has a little girl. And she was actually brought to court for attacking her mother after this too. Is that right? Yeah, she was let. Go for that as well. I didn't run into that one, man. Nothing's ever black and white, is it? No, it's all gray. Josh. It's all gray. The next one is fairly close to black and white as far as revenge goes. Chuck yeah, this one is pretty good. Come up and let's hear buddy anthony Stockleman in 2006, was put in prison for molesting and murdering a ten year old girl named Katie Coleman. Horrific incident, his come up, and it came right away in the case of you're going to jail for life. And it wasn't like there was a lot of didn't he do it? Apparently it was a slam dunk case. There were red carpet fibers that matched the carpet in his mom's house found at the scene. His DNA was on the body and on a cigarette butt at the scene. And an eyewitness saw Katie Coleman riding in Anthony Stockman's pickup truck that day. Yeah. So he copped a deal to avoid the death penalty and went to prison for the rest of his life. Went to prison. And unfortunately, he went to prison with Jared Harris, who was a burglary inmate serving time for burglary. And also Katie Coleman's cousin. Yeah, because they had a different last name. Indiana board of corrections missed that. This is Katie Coleman's cousin. Yeah, because they would look to avoid areas like that. Sure. Okay. I don't know the rules. I would think there would be protocol for that kind of thing. Yeah, I would think so. After a couple of months, stockleman shows up one day for breakfast with a fresh tattoo carved into his head that says katie's revenge. And very, very big, prominent block letters, like his entire forehead is covered in this amateur tattoo. Did you see it? Yeah, I think one of the guards ended up posting that and got in trouble, posted the photo. So the board of corrections looked into it, said, oh, we can't implicate the cousin, so who knows who did it? And that was that. Yeah, well, no, he actually served extra time for assault. Oh, they got him. When I wrote this, they still hadn't. They were like, we can't find any evidence that it was him. They got him. I'm sure he was like, fine, tacking on, he was going to kill him. He did one of those deals where the dude looks up and all of a sudden this guy is in a cell with the door closed behind him and put his hands on his throat and said, I'm either going to stick you or I'm going to tattoo your forehead. And he was like, tattoo? I don't know if he actually gave him the choice, but he had a prison tattoo gun that he ditched in the trash, and I can find pictures of it online. Thanks for the follow up stuff, man. Sure. That's awesome. Well, not awesome for Jared Harris. Not the actor Jared Harris. By the way, it's under richard Harris. Anthony stockwoman. No, I mean Jared Harris is the cousin. Oh, yeah. But he's not the famous actor son of Richard Harris. Jared Lido. Okay, we're up to our last one. This is all we're doing. This is number six, I think, right? Yeah. Which one of these you want to do? What do you have? I got Dachau. And what's the other one? James Annesley. Let's do Dachow. Okay. Am I saying it correctly? Sure, you say it. I'll see if I'm saying it correctly. Well, people just say docao. Okay. Yeah. You're sort of over to it a little bit. This is one that Quentin Tarantino probably got some inspiration for his movie in Glorious Bastards. And it was in Shutter Island prominently. Tarantino is doing a slave revenge movie next. No, I didn't know that. An escape slave. In fact, you could argue that most of his movies are revenge movies. Yeah, like almost all of them. Reservoir Dogs is revenge, except executing Tim Roth and the cop scene. Oh, yeah. With the ear. But that wasn't really revenge. No. Kill Bill. Total revenge movie. The Car Win was revenge and Gloria's Bastards was revenge and now the slave run away. Pulp Fiction. Was there any revenge in there? There was more redemption than revenge. Yes. I mean, well, revenge against the rapists. Oh, yeah. That was big time revenge. Calling some pipettin. Yeah. So there's been elements of revenge. Let's at least say that. Okay. Okay. So back to World War II. Did you know that Quentin Tarantino and Alan Ball, the writer of 6ft under, have an ongoing feud that Tarantino brought the law into? Really? Apparently, Allen Ball and his husband or partner, one of the two raised tropical birds in their Los Angeles home. Sounds nice. And they have an aviary, and apparently it's not fully enclosed. And Quentin Tarantino, who lives next door, has to hear birds squawking all day and can't get any work done. Really? So he's, like, going to court to basically get the courts to tell Alan Ball to tell the birds to shut up. Interesting, isn't it? Stored one another? Well, I know where that is then, because I used to work for a director that supposedly lived a few houses down from QT. Oh, really? Because when I went and picked him up, he was like, hey, you know who lives right there? Quentin Tarantino. And I guess Alan ball on the other side. Yeah. Who do you sign with? I'm a big fan of both. Oh, yeah? I love Alan Ball and Tarantino. I don't think you should keep birds in captivity, so I'm going to go with Tarantino on this. All right. What if you were a gigantic snack food maker and you had to wrestle a massively complex supply chain to satisfy cravings from Tokyo to Toledo? So you partner with IBM Consulting to bring together data and workflows so that every driver and merchandiser can serve up jalapeno, sesame and chocolate covered goodness with real time datadriven precision. Let's create supply chains that have an appetite for performance. IBM, let's create. Learn more at IBM. Comconsulting. Hey, everyone. When you're running a small business, every second counts and you can't afford to waste a single moment. So why are you still taking time out of your day to go to the post office when you could be using stamps.com? Yeah. For more than 20 years, stamps.com has been indispensable for over 1 million businesses because stamps.com gives you access to all the post office and ups shipping services you need right from your computer. That's right. You can streamline your shipping process with stamps.com easy to use software. All you need is your regular computer and printer. No special supplies or equipment necessary. And you can get discounts you can't find anywhere else, like up to 30% off USPS. Rates and 86% off ups. So stop wasting time and start saving money. When you use Stamps.com to mail and ship, sign up with promo code stuff for a special offer that includes a four week trial plus free postage and a digital scale. No long term commitments or contracts. Just go to stamps.com. Click the microphone at the top of the home page and enter code stuff. So now back to world war two. Finally. All right. Dacow obviously was one of the sites of the atrocities committed against the Jewish people at their prison camp there. Awful things happened. And when the American soldiers of the 45th thunderbird army infantry division showed up to take that camp, they exacted a little revenge. Well, they had a huge impetus. There was what was called the death car, the death train, which is 39 rail cars that were on a rail line that were parked basically just inside the camp walls. And they were literally overflowing with the dead and dying, I think, almost 3000 corpses spilling out of these rail cars. And that's what these guys came upon. The members of the thunderbird army infantry, the 45th thunderbird division found this and apparently just snapped in. What's the worst army infantry atrocity carried out by any allied force supposedly in world war II. And this is pretty atrocious. Well, I mean, basically there are different reports on what went on. I tried to look at a bunch of different ones, but we do know that they at one point lined some SS up against the wall, mowed them down with machine guns. So unarmed, by the way. And this is also duck cow is the site where a lot of SS officers came to surrender. They weren't even in the camp. This is like, oh, the Americans took this camp. I want to surrender. I'm going to go surrender. Right. And they were executed. And apparently one report says that some of the US. Soldiers gave some of the freed inmates guns and like shovels and things and said, have added fellows, and they exacted their own revenge. Some of the Jewish inmates they would have fewer problems with. Yeah, of course. But apparently General Georgia's Patton had no problem with any of it. Some of the people there, some of the army guys, the US. Army guys, I would probably say the lion share had a problem with what was going on and complained, filed report, and there was a classified army investigation that said, yeah, this happened. And there were about 28 unarmed Germans that were executed at Dacow that day. And here's all the evidence patting through the stuff in the trash and said, you guys go home. Forget this ever happened. But one copy was put in the National Archives. It was mislabeled, and it sat there until 1987, and no one had any clue about it until the Boston Globe did, like this four or five part series on the DoCAU massacre in 2001, and that finally brought it to light. Wow. Yeah. So that's number two. Well, they weren't labeled in order of importance. They were just ten. Right. It even says in no particular order. Yeah. Because it's kind of sick to say, like, this is the best, or this is the worst. Exactly. In cases like this, I did go to Film School Rejects, though, which is the fun website, because I just started thinking about revenge movies. It's a common theme, and they listed. This is their top ten. Commando. Oh, yeah. That's a good one. Gladiator. Yeah. Friday Jerry. Laughter friday the 13th. Yeah. Well, those kids watched her son drown. Yeah. Oh, that's true. Been her one of the granddaddies of all revenge movies. I never saw it. Good one. I am ben her like that. Yeah, that one. Star Dogs is crazy. We were just talking about the other day. It was disturbing. Kill Bill One and two. Yeah. Once upon a time in the west. I never saw that one either. It's supposed to be awesome. That's a good one. The Virgin Spring, which I have not seen. That was a Bergman picture. Okay. And The Godfather, which I didn't really see that as a revenge pick. Revenge. Yeah. And they said Death Wish is the number one. Yeah. But they didn't have Old Boy on there. Oh, wow. Yeah. The ultimate revenge movie. That's as revenge as a kid. Yeah. So then I trolled some other top ten list and some of the other ones that made the list. Memento. Mad Max. Carrie great revenge movie. And Gloria's Bastards, obviously. The professional. The crow hard candy. Okay. Which you should see. I will not be confused with Jawbreaker. I'll bet you ever seen that movie. No, I didn't see that. It was good, surprisingly. Yeah. I spit on your grave. Irreversible that one was pretty hardcore. You me like that movie. I haven't seen it yet. Irreversible yeah, she said it's really good. It's really tough to watch, but she said it was a good move. It is. Well, it's a rape revenge, so those are always the best. What about last house on the left? That's a rape. That's like the rape eventual. That was next on my list. Or was that before or after I spin on your grave? When was I spin on your grave? Does it have the date? No, I don't have the dates because last house on the left, I think, was 1972, Munich. Oh, yeah. I spit on Your grave is like 81. Was it? Yes. Munich. That's a great revenge movie. Star Trek two Wrath of Con. No. Really? Yeah. Unforgiven. Pretty good one. I mean, great movie, but I wouldn't throw it in the super revenge category. Sure. And then taken with Liam neeson. I enjoyed that. I did, too. I just can't get past Liam Neeson as an action star. He has a set of very specific set of skills, and they make it unwatchable. All right, so that is revenge. And it's best served what with Liam Neeson? Piping hot. Yeah, that was like six of ten. So there's more for you to go read. Housetepworks.com. The article I wrote, just type in biggest revenge or even probably just revenge in the search bar housedefirst.com. And that's going to bring up this article. So do that. And I said search bar, which means the type of listener mail. Or is it? It's not quite yet. Chuck, we should tell everybody about Kiva. Man, we did it. We did what? We met our goal in this million dollar march. Yes. $1 million in loans over the past three months. Less than three and a half. And it all started with a little jab at Colbert Nation. And they're just like, we left them in the dust years ago. I know. When you watch that video, it's so quaint. We're like, first one to $100,000. I know. I remember. Everybody was like, there's no way you're going to make it to $100,000. Crazy. That's a million dollars loaned by our Kiva team. It takes a village job. We are proud of you guys. Thank you. Yes. Seriously. And I guess let's just keep going on. Let's double down. Yeah. Thank you to Glenn and Sonia, as always, for helping us set our financial goals. And we'll have a new one coming up soon. Yeah, we're not like Aaron. We got a million forget it. We're done, right? We're going to bed. Everyone pulled their money out, right? Go party. No, don't do that. Okay? That's for December 10, 2012. Okay. All right, so back to it. All right, Josh, I'm going to call this cannibalism. It's been a while, but it's about cannibalism, okay? And I like to read good, smart ones. And this is one of those guys. I'm a biology undergrad at University of New Mexico. Go, Jeez. What are they? Go fighting Aztec, let's say. I bet you're right. One of my recent projects was a computer model attempting to answer some questions regarding disease transmission through cannibalism you close the podcast with speculation about the origin of cannibalism in humans. Materialism versus idealism. Though both of these arguments are compelling, they both seem to ignore just how young the human species is. The prevalence of conspecific necrogphagi. Necrophage. necrophagy. Let's say necrophagy. That sounds good. Yeah, man, I had that all worked out, too. Eating the flesh of the dead in other species provides evidence that cannibalism is significantly older than us. And the prevalence in near species like chimp suggests that it may be a trait we've had since we have been a wee nice. Yeah, lobsters are big. Cannibals are they dirty things? Spiders of the sea. The materialism versus idealism argument takes on all new facets. When applied to chimps, materialism doesn't hold very much water, as chimps are pretty well fed on fruits, and catching smaller simeons is far easier and arguably adequate nutrition. Idealism begs the question of just how much chimps care about that sort of thing. Are they expecting some gain other than nutritional value, like spiritual, or even just striking fear to the hearts of enemies? Are they even capable of this? My guess, which is just a guess, is that they kill for territorial reasons and then simply don't want to waste a large quantity of delicious. Dude, that's what he thinks. Maybe we started that way and some cultures just held onto the practice, applying spiritual reasoning after the fact. And that is smart. And that is from Micah. That's Micah. That is smart. From New Mexico. And it was New Mexico State. Golden gophers. No, that's Minnesota. The bear cats. The New Mexico State bear cats. No. Eagles. Hold on. No, that's our school. Georgia, if you had your interest piqued by Micah's assessment of cannibalism, you might want to go listen to our cannibalism podcast. We did an episode on it a while back and it's one of our favorites. Pretty good. And let's see what else. If you have a great revenge story, we want to hear it. Yeah, there's lots of Internet revenge going on. I was going to talk about some of it, like people who post none and all that. Oh, I know what you mean. I don't like that. Like, oh, my boyfriend wrong me, so let me do photoshops of him in a bikini and make it a meme. I don't know. Okay, so I guess we're going to avoid everybody because we don't want to upset Chuck, because we know he'll lie and wait for it to come up. And you can send us a cool story of revenge. Non internet, please to us at Twitter. Our handle is syscast or on Facebook at facebook. Comstuffyshenko. And you can send us a plain old fashioned email to stuffpodcast@discovery.com. Be sure to check out our new video podcast, Stuff from the Future. Join House department staff as we explore the most promising and perplexing possibilities of tomorrow. Brought to you by the Reinvented 2012 Camry. It's ready. Are you? Hey, everybody. I don't know about you. But I am excited that it's summer. School's out, the sun is shining, and best of all, there's downtime four days. That's where true crime podcasts on Amazon music come in. There's a perfect activity for last minute road trips, long walks, or, if you're brave enough, late nights. With so many killer shows like Morbid, my Favorite Murder, and Small Town Murder, you'll never be bored to death again. So download the free Amazon Music app to start listening to all your favorite true crime podcasts. Plus, with Amazon Music, you can access new episodes early. Download the app today.", "author": "sysk", "guid": "od1pj0hhjo-03e8-4fef-8cba-802881b06e6a", "url": "https://chtbl.com/track/5899E/podtrac.com/pts/redirect.mp3/traffic.omny.fm/d/clips/e73c998e-6e60-432f-8610-ae210140c5b1/a91018a4-ea4f-4130-bf55-ae270180c327/ae5757c8-c106-4da9-94aa-ae2800a94790/audio.mp3?utm_source=Podcast&in_playlist=44710ecc-10bb-48d1-93c7-ae270180c33e"}}}